{
  "name": "Bump",
  "script": "Bump.js",
  "version": "0.2.19",
  "description": "Bump provides a way to invisibly manipulate tokens on the GM Layer from the Objects Layer, and vice versa.\r\rWhen a token is added to Bump a slave token is created that mimics everything about to master token. The slave token is only visible to the GM and has a color on it to show if the master token is on the GM Layer or the Objects layer. Moving the slave token will move the master token and vice versa. The slave token represents the same character as the master token and changes on the slave token will be reflected on the master token.\r\r## Commands\r\r```!bump-slave [--push|--help]```\r\rAdds the selected tokens to Bump, creating their slave tokens.\r\r* `--push` -- If the selected token is on the Objects Layer, it will be pushed to the GM Layer.\r* `--help` -- Shows the help and configuration in game.\r\r```!bump [--help]```\r\rUsing `!bump` on a token in Bump causes it to swap with its counterpart on the other layer.\r\r* `--help` -- Shows the help and configuration in game.",
  "authors": "The Aaron",
  "roll20userid": "104025",
  "patreon": "https://www.patreon.com/shdwjk",
  "useroptions": [
    {
      "name": "Visible Color",
      "type": "text",
      "default": "#008000",
      "description": "This is the color the overlay turns when the Bumped token is visible to the players on the Object Layer.  Colors must be an HTML color of the form `#RRGGBB` or the word `transparent`."
    },
    {
      "name": "Invisible Color",
      "type": "text",
      "default": "#800080",
      "description": "This is the color the overlay turns when the Bumped token is invisible to the players on the GM Layer.  Colors must be an HTML color of the form `#RRGGBB` or the word `transparent`."
    },
    {
      "name": "Auto Push",
      "type": "checkbox",
      "description": "Select this checkbox if you want slaved tokens to be pushed to the GM Layer as soon as they are added to Bump.",
      "value": "autoPush"
    },
    {
      "name": "Auto Slave",
      "type": "checkbox",
      "description": "Select this checkbox if you want selected tokens that have not been slaved to be added to bump whenever `!bump` is executed.",
      "value": "autoSlave"
    },
    {
      "name": "Auto Unslave",
      "type": "checkbox",
      "description": "Select this checkbox if you want selected tokens that have been slaved to be unslaved when they are moved to the token layer when `!bump` is executed.",
      "value": "autoUnslave"
    },
    {
      "name": "No Bars on Slave",
      "type": "checkbox",
      "description": "Select this checkbox if you want slave tokens to only mirror the current value, and to not have their own bars.",
      "value": "noBars"
    }
  ],
  "dependencies": [],
  "modifies": {
    "state.Bump": "read,write",
    "graphics": "create,remove",
    "graphics.*": "read,write",
    "campaign.turnorder": "read",
    "player.displayname": "read"
  },
  "conflicts": [],
  "previousversions": [
    "0.2.10",
    "0.2.11",
    "0.2.12",
    "0.2.13",
    "0.2.14",
    "0.2.16",
    "0.2.17",
    "0.2.18",
    "0.2.8",
    "0.2.9"
  ]
}