{
    "name": "Custom Status Markers",
    "script": "CustomStatusMarkers.js",
    "version": "3.3.2",
    "previousversions": ["1.5", "2.0", "2.1", "3.0.1", "3.1", "3.2.1", "3.3.1"],
    "description": "# Custom Status Markers\rThis script allows users to create custom status markers for tokens.\rWhen this script is installed, it creates a 'CustomStatusMarkers' macro for\rdisplaying the script's menu.\r\r## Opening the menu\rTo open the script's menu, just run the 'CustomStatusMarkers' macro installed\rby this script.\r\r## Custom Status Markers menu\rThis menu shows all your game's custom status markers and allows you and your\rplayers to toggle them on and off on tokens they control.\r\r### Toggle\rTo give a token a custom status marker or to remove a custom status marker from\ra token, do the following:\r\r1. Select one or more tokens to assign the status maker to.\r2. Click the 'toggle' button for the status marker button in the menu.\r\r### Counter (# button)\rYou can create a numerical badge for status markers.\r\r1. Select one or more tokens to set a status badge to.\r2. Click the 'count' button for the status marker you want a badge for.\r3. Enter the number for the badge. Enter nothing to remove the badge.\r\r### Tint (rainbow button)\rYou can set a tint color for status marker icons.\r\r1. Select one or more tokens to set a status badge to.\r2. Click the palette button for the status marker you want to change the icon tint color for.\r3. Enter in the color name or hex value. Enter nothing to remove the tint color.\r\r### Deleting status markers\rYou can delete one of your saved custom status markers by clicking the 'X'\rbutton next to it in the menu. This button is only available to the GM.\r\r## Options menu\rThis menu provides global configurations used by the Custom Status Markers\rscript. It is only available to the GM.\r\r### Icon Size\rThis configuration sets the size of the script's status icons, in pixels.\r\r### Icon Alignment\rThis configuration sets how custom status icons are displayed relative to\rtheir host token and built-in status markers. Options include:\r\r* Above: Custom status markers are displayed above their token.\r* Inline: Custom status markers are displayed in front of their token, alongside any built-in status markers.\r\r## Menu Actions\rThis menu has several buttons for managing the game's custom status markers.\rIt is only available to the GM.\r\r### New Status Marker\rYou can create markers from any graphic you have uploaded to your library. When you've\rchosen the graphic for the marker, do the following to save it:\r\r1. Select the marker's graphic.\r2. Click the 'New Status Marker' button in the menu.\r3. Give it a name.\r\r### Remove Token Markers\rThis button removes all custom status markers currently on the selected token.\r\r### Import/Export State\rThe Import State and Export State buttons allow GMs to transfer their custom\rstatus markers between games. Clicking Export State will show the JSON data\rfor the current game's custom status markers. This JSON can be copied and\rpasted into the Import State button's prompt in another game. Please note that\rimporting the state will overwrite the custom status markers already\rin the game.\r\r### Clear State\rThis command will clear the Custom Status Markers module's state.\rWarning: This will delete all your saved custom status markers!\r\r## Help\rIf you experience any issues while using this script or the trap themes,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\ror create a help thread on the Roll20 API forum\r\r## Show Support\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/publisher/165/stephen-lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["Path Math"],
    "modifies": {
        "chat": "write",
        "text": "read, write",
        "token": "read, write"
    },
    "conflicts": []
}
