{
    "name": "Custom Status Markers",
    "script": "CustomStatusMarkers.js",
    "version": "3.1",
    "previousversions": ["1.5", "2.0", "2.1", "3.0.1"],
    "description": "# Custom Status Markers\r\r_3.1 Updates_\r* Added option to the chat menu to change the size of custom status icons.\r* Custom status markers are now displayed above the built-in markers instead of to the left of the built-in markers.\r\rThis script allows users to create custom status markers for tokens.\rWhen this script is installed, it creates a 'CustomStatusMarkers' macro for\rdisplaying the script's menu.\r\r## Opening the menu\r\rTo open the script's menu, just run the 'CustomStatusMarkers' macro installed\rby this script.\r\r## Creating status markers\r\rYou can create markers from any graphic you have uploaded to your library. When you've\rchosen the graphic for the marker, do the following to save it:\r1) Select the marker's graphic.\r2) Click the 'New Status Marker' button in the menu.\r3) Give it a name.\r\r## Toggling status markers on tokens\r\rTo give a token a custom status marker or to remove a custom status marker from\ra token, do the following:\r1) Select one or more tokens to assign the status maker to.\r2) Click the 'toggle' button for the status marker button in the menu.\r\r## Setting a counter on status markers\r\rYou can create a numerical badge for status markers.\r1) Select one or more tokens to set a status badge to.\r2) Click the 'count' button for the status marker you want a badge for.\r3) Enter the number for the badge. Enter nothing to remove the badge.\r\r## Setting the tint color on status markers\r\rYou can set a tint color for status marker icons.\r1) Select one or more tokens to set a status badge to.\r2) Click the palette button for the status marker you want to change the icon tint color for.\r3) Enter in the color name or hex value. Enter nothing to remove the tint color.\r\r## Deleting status markers\r\rYou can delete one of your saved custom status markers by clicking the 'X'\rbutton next to it in the menu.\r\r## Clearing the Custom Status Markers state\r\rA command is provided for clearing the Custom Status Markers module's state.\rWarning: This will delete all your saved custom status markers!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["Path Math"],
    "modifies": {
        "chat": "write",
        "text": "read, write",
        "token": "read, write"
    },
    "conflicts": []
}
