{
  "name": "GameAssist",
  "script": "GameAssist.js",
  "version": "0.1.1.1",
  "previousversions": ["0.1.1.0"],
  "description": "GameAssist is a modular Roll20 API automation suite for D&D 5E (2014 Character Sheet; not yet tested on 2024).\n\nIt streamlines DM workflow with hot-reload modules for crit fumbles, NPC death markers, concentration checks, and automatic HP rolling, all managed by a stable event queue and in-chat config (no sandbox reloads needed).\n\nRequirements:\n- Roll20 Pro (API access)\n- TokenMod (from Mod Library, must be installed above GameAssist in API order)\n- 7 Rollable Tables (case-sensitive): CF-Melee, CF-Ranged, CF-Thrown, CF-Spell, CF-Natural, Confirm-Crit-Martial, Confirm-Crit-Magic\n\nAfter installing GameAssist.js and TokenMod, create these Rollable Tables in the Collection tab. CritFumble and confirmation features will not work until tables exist and are correctly named.\n\nUse !ga-status to check module readiness; modules show Ready only if requirements are met.\n\nCore commands:\n  - !ga-enable <Module>\n  - !ga-disable <Module>\n  - !ga-config list|get|set|modules\n  - !npc-hp-all\n  - !npc-hp-selected\n  - !concentration\n  - !cc\n  - !npc-death-report\n  - !critfail\n  - !critfumble help\n\nCore modules:\n- CritFumble (customizable fumble results via Rollable Tables)\n- NPCManager (automated dead marker management for NPCs)\n- ConcentrationTracker (auto concentration checks and markers)\n- NPCHPRoller (rolls and sets HP)\n\nMost features require TokenMod for marker automation. Missing TokenMod will limit functionality.\n\nFor full documentation, detailed setup, troubleshooting, and sample Rollable Table entries, visit https://github.com/Mord-Eagle/GameAssist/blob/main/README.md\n\nTo report issues or request features, use https://github.com/Mord-Eagle/GameAssist/issues\n\nChangelog:\n- v0.1.1.1: Quiet-startup flag, improved log output\n- v0.1.1.0: Initial public release\n\nIf a module is not working, check Rollable Table names and TokenMod install order, then see the README or open an Issue on GitHub."
  "authors": "Mord Eagle",
  "roll20userid": "10646976",
  "dependencies": {
    "TokenMod": ""
  },
  "modifies": [],
  "conflicts": [
    "Other scripts that modify NPC HP or use bar1_value"
  ],
  "useroptions": [],
  "commands": [
    "!ga-enable",
    "!ga-disable",
    "!ga-config",
    "!npc-hp-all",
    "!npc-hp-selected",
    "!npc-death-report",
    "!concentration",
    "!cc",
    "!critfail",
    "!critfumble"
  ]
}
