{
    "name": "It's a Trap!",
    "script": "ItsATrap.js",
    "version": "3.9.4",
    "previousversions": ["2.0", "2.1", "2.2", "2.3", "2.4", "2.5", "2.6", "2.7", "3.0", "3.1", "3.2", "3.3", "3.4", "3.5.2", "3.6", "3.7.4", "3.8", "3.9.1", "3.9.2", "3.9.3"],
    "description": "# It's A Trap!\r\r_v3.9 Updates:_\r* Implemented delayed activation for traps. See the 'Delay Activation' property.\r\rThis is a script that allows GMs to quickly and very easily set up traps,\rsecret doors, and other hidden things on the GM layer, and detect when tokens\ron the objects layer move over them. This trap detection even works for tokens\rmoving by waypoints.\r\rCombined with modules called Trap Themes, this script also allows system-specific\rautomation of trap effects and passive perception used to spot them.\r\r## Creating traps:\r\rPlace the token for your trap on the ```GM layer```.\rThen, select the trap token and activate its 'ItsATrap_trapCreationWizard' token macro.\rThis will present a menu for setting up the trap's configurations.\r\r## Trap properties\r\rThe following subsections go into detail about each of these configurations.\r\r### Core properties\r\r#### Name\rThis is the name of the trap.\r\re.g. 'pit trap' or 'explosive runes'\r\r#### Type\rThe It's A Trap! script, contrary to its name, can be used to automate more kinds of\rhidden objects than just traps. By default, the value of this property will just be\r'trap', but you could define it to be something like 'hazard', 'hidden enemy',\ror 'concealed item' instead. This type will appear in the trap's header when\rit is activated.\r\rE.g., the header will read 'IT'S A TRAP!!!' if the type is 'trap', or\r'IT'S A HAZARD!!!' if the type is 'hazard'\r\rThis property otherwise has no mechanical effect.\r\r#### Message\rThis message will be displayed when the trap is activated.\r\re.g. 'You feel a floor sink under your feet as you step on a hidden pressure plate. Behind you, you hear the violent grinding of stone against stone, getting closer. A massive rolling boulder is heading this way!'\r\r#### Disabled\rThis sets whether the trap is currently disabled or not. A trap that is disabled\rwill not be activated if it is triggered.\r\r#### GM Only\rThis sets whether the trap's activation will only be shared with the GM. If this\ris set to 'yes', the trap's GM Notes and its theme-based results will be\rshared only with the GM. Visible effects of a trap, such as the its message,\rsound, Areas of Effect, etc. will be ignored, and the trap will not be revealed.\r\rThis property is best used for traps, hazards, and alarms whose effects will\rnot be readily apparent when they are activated.\r\re.g. This could be set to 'yes' for a tripwire that alerts monsters in\ranother room to the party's presence.\r\r#### GM Notes\rThese notes are whispered to the GM when the trap is activated.\r\re.g. 'The tripwire sets off a silent alarm, alerting the mindflayers in the laboratory room to the party's presence.'\r\r#### Destroyable\rIf this is set to 'yes', the trap's token will be deleted after it has been activated.\r\r### Shape properties\r\r#### Affects Flying Tokens\rBy default, traps will only affect tokens that are not flying. Tokens are treated as 'flying' by this script if they have the 'fluffy wing' status marker active.\r\rIf this property is set to 'yes', it will affect all tokens, regardless of whether\ror not they have the 'fluffy wing' status marker active.\r\rLeave this set to 'no' for floor-based traps. For traps that affect creatures on\rthe ground and in the air alike, set this to 'yes'.\r\r#### Blast Distance\rThis property is only relevant if the trap's 'Trap Shape' property is set to\reither 'circle' or 'rectangle'.\r\rBy default, a token will only affect creatures overlapping its token when it\ris activated. Setting this to a number of units greater than 0 will increase\rthe size of the trap's activated area.\r\re.g., Setting this to 10 will make it so that all tokens within 10 ft\r(assuming the page's units are measured in feet) of the trap's token will be\raffected by it when it activates.\r\r#### Stops Tokens At\rThis property determines how the trap affects the movement of the token that\rtriggered it. Options include:\r\r* center (default): The token is dragged into the center of the trap's token. This option only functions if the Trap Shape property is set to either 'circle' or 'rectangle'.\r* edge: The token is stopped at the exact spot where they triggered the trap, whether this is at the edge of the trap's token or along one of its triggering paths.\r* none: The token's movement is not affected.\r\rThis property is ignored if the Delay Activation property is set.\r\r#### Trap Shape\rThis property determines the shape of the trap's activated area (the area in\rwhich creatures are actually in danger of being hit by the trap). This can be\reither the trap's token itself, or it can be defined to be one or more drawn\rpaths or filled polygons. Options include:\r\r* circle (default): The trap's token is its activated area, using a circular shape. Paired with the Blast Distance property, the radius of this circular area can be extended.\r* rectangle: The trap's token is its activated area, treating it as a rectangular shape defined by the token's bounding box. Paired with the Blast Distance property, the size of this rectangular area can be extended.\r* set selected paths: To use this option, you must have one or more drawn paths or filled polygons selected. These paths/polygons will be used as the trap's activated area.\r* add selected paths: The selected paths/polygons will be added to the trap's activated area.\r* remove selected paths: The selected paths/polygons will be removed from the trap's activated area.\r\r### Trigger properties\r\r#### Set trigger\rThis defines whether the trap is triggered either by a creature crossing its\rown token or by crossing a drawn path. Options include:\r\r* self (default): The trap's token is used as the triggering area for the trap. If a creature crosses over the trap's token, the trap will activate.\r* set selected paths: To use this option, you must have one or more drawn paths selected. Those paths will be used as the trap's triggering area. If a creature crosses over one of these paths, the trap will activate.\r* add selected paths: The selected paths will be added to the trap's triggering area.\r* remove selected paths: The selected paths will be removed from the trap's triggering area.\r\r#### Other Traps Triggered\rThis property is used to set other traps that will be triggered when this trap is activated.\r\r* none (default): No other traps will be triggered by this trap.\r* set selected traps: To use this option, you must have one or more trap tokens selected. These traps will be triggered when this trap is activated.\r* add selected traps: Add the selected traps to the set of traps that will be triggered when this trap is activated.\r* remove selected traps: Remove the selected traps from the set of traps that will be triggered when this trap is activated.\r\r#### Ignore Tokens\rThis property is used to select one or more creature tokens that will not be affected by a trap. Neither can these tokens trigger the trap.\r\r* none (default): No ignored tokens.\r* set selected tokens: To use this option, you must have one or more tokens selected. These tokens will be ignored by the trap.\r* add selected tokens: Add the selected tokens to the trap's set of ignored tokens.\r* remove selected tokens: Remove the selected tokens from the trap's set of ignored tokens.\r\r#### Delay Activation\rThis property sets a delay, in seconds, between when the trap is triggered to\rwhen it actually activates.\r\rAs a side-effect, the trap's trigger will be deactivated once this delay is\ractivated. This is to prevent the delayed trap from triggering multiple times.\r\r### Reveal properties\r\r#### Max Search Distance\rThis property defines the distance at which a character can attempt to notice a\rtrap passively. This distance is measured in whatever units are used by the page.\rIf this is not set, the search distance is assumed to be infinite.\r\rDynamic lighting walls will block line of sight to a trap, even if the character\ris close enough to otherwise try to passively spot it.\r\re.g. If this is set to 10, then a character must be within 10 ft (assuming the page's units are in feet) of the trap in order to passively notice it.\r\r#### When Activated\rThis property sets whether the trap will be revealed when it is activated. If\rset to 'yes', the trap's token will be moved to either the map or objects layer,\ras determined by the Layer property, when it is activated. Otherwise, it will\rremain hidden on the GM layer.\r\r#### When Spotted\rThis property sets whether the trap will be revealed when it is passively\rspotted. If set to 'yes', the trap's token will be moved to either the map or\robjects layer, as determined by the Layer property, when it is spotted. Otherwise,\rthe trap will be marked with a yellow circle when it is spotted.\r\rNote that if a trap is moved away from the GM layer when it is spotted, it\rcannot be triggered until it is moved back.\r\r#### Layer\rWhen the trap is revealed, it will be moved to the layer indicated by this property.\r\r### Special properties\r\r#### API Command\rThis property can be used to issue an API chat command when the trap activates.\rThis property supports a couple keywords to support commands involving the trap\rand its victims.\r\rThe keyword TRAP_ID will be substituted for the ID of the trap's token.\r\rThe keyword VICTIM_ID will be substituted for the ID of token for some character\rbeing affected by the trap. If there are multiple victims affected by the trap,\rthe command will be issued individually for each victim.\r\re.g. '!someApiCommand TRAP_ID VICTIM_ID'\r\r#### Special FX\rThis property is used to display a particle effect when the trap activates,\rusing Roll20's special FX system.\r\rThe first prompt asks for the name of the effect that will be displayed. This can\reither be the name of a custom special effect you've created, or it can be the\rname of a built in effect. Built-in special effects follow the naming convention\r'effect-color'. See https://wiki.roll20.net/Custom_FX#Built-in_Effects for more\rinformation on supported built-in effect and color names.\r\rThe second prompt allows you to specify an offset of the effect's origin point,\rin the format [X,Y]. The X,Y offset, relative to the trap's token is measured\rin squares. If this is omitted, the trap's token will be used as the effect's\rorigin point.\r\rThe third prompt allows you to specify a vector for the direction of the effect,\rin the format [X,Y], with each vector component measured in squares. If this\ris omitted, the effect will be directed towards the victims' tokens.\r\r#### Sound\rThis property sets a sound from your jukebox to be played when the trap is activated.\r\r### External script properties\r\r#### Areas of Effect script\rThis property is only available if you have the Areas of Effect script (by me) installed.\rIt also requires you to have at least one effect saved in that script.\rThis allows you to have the trap spawn an area of effect graphic when it is triggered.\r\rThe first prompt for this property will ask you to choose an area of effect chosen\rfrom those saved in the Areas of Effect script.\r\rThe second prompt will ask for a vector in the form [dx,dy], indicating the\rdirection of the effect. Each component of this vector is measured in squares.\rIf this vector is omitted, the effect will be directed towards the victims' tokens.\r\r#### KABOOM script\rThis property is only available if you have the KABOOM script\r(by Bodin Punyaprateep (PaprikaCC)) installed. This allows you to create a\rKABOOM effect centered on the trap's token. This can be handy for pushing tokens\rback due to an explosive trap!\r\rThe prompts for the property are used to define the properties for the KABOOM effect,\ras defined in the KABOOM script's documentation.\r\r#### TokenMod script\rThis property is only available if you have the TokenMod script (by The Aaron)\rinstalled. This allows you to set properties on tokens affected by the trap, using\rthe API command parameters described in the TokenMod script's documentation.\r\re.g. '--set statusmarkers|broken-shield'\r\r## Trap Themes:\r\rTrapThemes are used to provide support for formatting messages for traps and\rautomating system-specific trap activation and passive search mechanics.\r\rBy default the ```default``` theme will be used. This is a very basic,\rsystem-agnostic TrapTheme which provides support for the basic TrapEffect properties\rand has no passive search mechanics.\r\rIf you install a system-specific trap theme, then It's A Trap will automatically use\rthat theme instead.\r\rAdditional system-specific themes are available as their own API scripts.\rIf you would like to implement a TrapTheme for your system, take a look at\rthe ```default``` or ```5E-OGL``` TrapThemes as an example to get you started.\r\r### Theme-specific properties\rThese properties available here are specific to whatever trap theme script\ris being used for your game system. This includes things such as modifiers\rfor the trap's attacks, the trap's damage, and the dice rolls needed to passively\rspot the trap.\r\rDocumentation for these properties are provided in the documentation for their\rtrap theme script.\r\r## Activating traps:\r\rIf a token moves across a trap or its trigger paths at ANY point during its\rmovement, the trap will be activated!\r\rA trap can also be manually activated by clicking the 'Activate Trap' button\rin the trap's configuration menu.\r\rAs of version 3.7, traps can be set to have their activation areas be either the\rtrap tokens themselves or be a set of paths on the GM layer. By default, the trap's\rtoken is still used as the activation area. You can change this by selecting a\rset of polygonal or freehand paths from the GM layer, and then setting  \rthe ```Trap Shape``` property for the trap to ```Paths```. This supports paths\rboth as lines (no fill color) and polygons (requires fill color).\r\r## Help\r\rIf you experience any issues while using this script or the trap themes,\rneed help using it, or if you have a neat suggestion for a new feature, please reply to this thread:\rhttps://app.roll20.net/forum/post/3280344/script-its-a-trap-v2-dot-3\ror shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=new&type=all&publisher=Stephen%20L)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [
        {
          "name": "announcer",
          "type": "text",
          "default": "Admiral Ackbar",
          "description": "What name is displayed in the chat for trap messages?"
        }
    ],
    "dependencies": [
      "Character Sheet Utils",
      "HTML Builder",
      "Token Collisions",
      "Path Math",
      "Vector Math"
    ],
    "modifies": {
        "chat": "write",
        "gmnotes": "read, write",
        "lastmove": "read, write",
        "layer": "read, write",
        "left": "read, write",
        "status_angel-outfit": "read",
        "status_bleeding-eye": "read",
        "status_cobweb": "read",
        "status_fluffy-wing": "read",
        "token": "read",
        "top": "read, write"
    },
    "conflicts": ["Blood and Honor"]
}
