{
    "name": "It's a Trap!",
    "script": "ItsATrap.js",
    "version": "2.2",
    "previousversions": [2.0, 2.1],
    "description": "# It's A Trap!\r\r###### Required Scripts\r* [Token Collisions](https://github.com/Roll20/roll20-api-scripts/tree/master/Token%20Collisions)\r* [Vector Math](https://github.com/Roll20/roll20-api-scripts/tree/master/Vector%20Math)\r\r###### Updates\r'''2.2'''\r* TrapThemes now supported for system-specific trap automation.\r\r'''2.1'''\r* Refactored code.\r* ItsATrap now exposes an API for its functions.\r* Customizable trap messages via GM notes.\r\rThis is a script that allows GMs to quickly and very easily set up traps on\rthe GM layer, and detect when tokens on the objects layer move over them. This\rtrap detection even works for tokens moving by waypoints.\r\r### Creating traps:\r\rPlace the token for your trap on the ```GM layer```. Give it the ```cobweb``` <img src=\"http://game-icons.net/icons/lorc/originals/png/cobweb.png\" width=\"32\"> status marker.\r\r<br/><br/>\rBy default, traps will only affect characters on the ground (ones that don't\rhave a ```wing``` <img src=\"http://game-icons.net/icons/lorc/originals/png/fluffy-wing.png\" width=\"32\"> or ```angel``` <img src=\"http://game-icons.net/icons/lorc/originals/png/angel-outfit.png\" width=\"32\"> status marker). To have a trap also affect flying\rcharacters, give it the ```wing``` <img src=\"http://game-icons.net/icons/lorc/originals/png/fluffy-wing.png\" width=\"32\"> or ```angel``` <img src=\"http://game-icons.net/icons/lorc/originals/png/angel-outfit.png\" width=\"32\"> status marker.\r\r<br/><br/>\rBy default, trap tokens won't appear when they are activated. If you would\rlike the trap to become visible to the players when it is activated, give it\rthe ```bleeding eye``` <img src=\"http://game-icons.net/icons/lorc/originals/png/bleeding-eye.png\" width=\"32\"> status marker. When the trap is activated, it will be moved to the ```Objects layer```.\r\r### Customizing trap messages:\r\rBy default, when a character activates a trap, it will just display a\rgeneric message that the character activated the trap.\r\rYou can specify a custom message, which can include inline\rrolls, in the GM notes for the trap. Admiral Ackbar will still dramatically\rannounce it.\r\r### Activating traps:\r\rIf a token moves across a trap at ANY point during its movement, the trap will\rbe activated!\r\r### TrapThemes:\r\rTrapThemes are used to provide support for displaying messages for traps and\rautomating system-specific trap activation and passive search mechanics.\r\rIf you are using the One-Click API Library, you can specify which theme to use\rin the 'theme' user option.\r\rBy default the 'default' theme will be used. This is a very basic,\rsystem-agnostic TrapTheme which provides support for the basic TrapEffect properties\rand has no passive search mechanics.\r\rAdditional system-specific themes will be made available as their own API scripts.\rIf you would like to implement a TrapTheme for your system, take a look at the\r5E-OGL TrapTheme as an example to get you started.\r\r### TrapEffects JSON:\r\rIn addition to being able to specify custom messages for traps, you can also define\rthe effects of a trap using JSON. This allows you to do things with traps beyond\rjust displaying simple messages such as playing sounds, providing attributes\rfor use in trap automation with TrapThemes, and even executing API chat commands.\r\rJust enter the JSON definition in for the trap in its GM notes.\r\rThe following basic TrapEffect properties are supported:\r* api (string): An API chat command that will be executed when the trap is activated. If the constants TRAP_ID and VICTIM_ID are provided, they will be replaced by the IDs for the trap token and the token for the trap's victim, respectively in the API chat command message.\r* message (string): This is the message that will be displayed when the trap activates.\r* sound (string): The name of a sound that will be played when the trap activates.\r* trapId (string): The ID of the trap token. This is set automatically by the script.\r* victimId (string): The I of the victim token. This is set automatically by the script.\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["Token Collisions", "Path Math"],
    "modifies": {
        "chat": "write",
        "gmnotes": "read",
        "lastmove": "write",
        "layer": "read, write",
        "left": "read, write",
        "status_angel-outfit": "read",
        "status_bleeding-eye": "read",
        "status_cobweb": "read",
        "status_fluffy-wing": "read",
        "token": "read",
        "top": "read, write"
    },
    "conflicts": []
}
