{
    "name": "It's a Trap!",
    "script": "ItsATrap.js",
    "version": "2.5",
    "previousversions": ["2.0", "2.1", "2.2", "2.3", "2.4"],
    "description": "# It's A Trap!\r\r###### Updates\r_2.5_\r* The script's API now exposes a announceTrap method for handling all universally supported trap output (messages, sounds, FX, etc.).\r* Trap JSON now supports a \"gmOnly\" property that displays the trap's message only to the GM.\r* Trap JSON now supports a \"stopAt\" property to make traps stop tokens at their center, edge, or not at all.\r\r_2.4_\r* Offsets and directions can be specified for beam-like special FX in the trap JSON.\r* A user option is provided for revealed traps to be sent to the map layer instead of the objects layer.\r* Traps can now have areas of effect beyond their trigger.\r\r_2.3_\r* Trap JSON now supports special FX. This is specified through the 'fx' property.\r\r_2.2_\r* TrapThemes now supported for system-specific trap automation.\r\r_2.1_\r* Refactored code.\r* ItsATrap now exposes an API for its functions.\r* Customizable trap messages via GM notes.\r\rThis is a script that allows GMs to quickly and very easily set up traps on\rthe GM layer, and detect when tokens on the objects layer move over them. This\rtrap detection even works for tokens moving by waypoints.\r\r### Creating traps:\r\rPlace the token for your trap on the ```GM layer```. Give it the ```cobweb``` <img src=\"http://game-icons.net/icons/lorc/originals/png/cobweb.png\" width=\"32\"> status marker.\r\r#### Flying tokens\rBy default, traps will only affect characters on the ground (ones that don't\rhave a ```wing``` <img src=\"http://game-icons.net/icons/lorc/originals/png/fluffy-wing.png\" width=\"32\"> or ```angel``` <img src=\"http://game-icons.net/icons/lorc/originals/png/angel-outfit.png\" width=\"32\"> status marker). To have a trap also affect flying\rcharacters, give it the ```wing``` <img src=\"http://game-icons.net/icons/lorc/originals/png/fluffy-wing.png\" width=\"32\"> or ```angel``` <img src=\"http://game-icons.net/icons/lorc/originals/png/angel-outfit.png\" width=\"32\"> status marker.\r\r#### Revealing traps\rIf you would like the trap to become visible to the players when it is activated, give it\rthe ```bleeding eye``` <img src=\"http://game-icons.net/icons/lorc/originals/png/bleeding-eye.png\" width=\"32\"> status marker.\rIf you checked the ```revealTrapsToMap``` option for this script, then the trap will be moved to the ```Map layer```.\rOtherwise, it will be moved to the ```Objects layer```.\r\r#### Area of effect\rYou can specify an area of effect for a trap by setting its ```Aura 1``` property.\rWhen the trap is activated, all tokens within that area will be affected by the\rtrap. Trap areas can be square or circular.\r\r#### Customizing trap messages:\r\rWhen a character activates a trap, it will display a\rgeneric message to tell everyone that the character activated the trap.\r\rYou can specify a custom message in the GM notes for the trap. This message\rcan include inline rolls.\r\r### Activating traps:\r\rIf a token moves across a trap at ANY point during its movement, the trap will\rbe activated!\r\r### TrapThemes:\r\rTrapThemes are used to provide support for displaying messages for traps and\rautomating system-specific trap activation and passive search mechanics.\r\rIf you are using the One-Click API Library, you can specify which theme to use\rin the 'theme' user option.\r\rBy default the 'default' theme will be used. This is a very basic,\rsystem-agnostic TrapTheme which provides support for the basic TrapEffect properties\rand has no passive search mechanics.\r\rAdditional system-specific themes will be made available as their own API scripts.\rIf you would like to implement a TrapTheme for your system, take a look at the\r\"default\" or \"5E-OGL\" TrapThemes as an example to get you started.\r\r### TrapEffects JSON:\r\rIn addition to being able to specify custom messages for traps, you can also define\rthe effects of a trap using JSON. This allows you to do things with traps beyond\rjust displaying simple messages such as playing sounds, providing attributes\rfor use in trap automation with TrapThemes, and even executing API chat commands.\r\rJust enter the JSON definition in for the trap in its GM notes.\r\rThe following basic TrapEffect properties are supported:\r* api (string): An API chat command that will be executed when the trap is activated. If the constants TRAP_ID and VICTIM_ID are provided, they will be replaced by the IDs for the trap token and the token for the trap's victim, respectively in the API chat command message.\r* fx (string, FX definition JSON, or object): The name of a special FX object or a definition for custom special FX.\r * fx.name (string or FX definition JSON): The name of a special FX object or a definition for custom special FX.\r * fx.offset (2-number array): The offset of the trap's FX, relative to the trap's token.\r * fx.direction (2-number array): For beam-like FX, this is the vector for the FX's direction.\r* gmOnly (boolean): If true, then the trap's message is only displayed to the GM.\r* message (string): This is the message that will be displayed when the trap activates.\r* sound (string): The name of a sound that will be played when the trap activates.\r* stopAt (string): This is where the trap stops the token. If \"edge\", then the token is stopped at the trap's edge. If \"center\", then the token is stopped at the trap's center. If \"none\", the token is not stopped by the trap. Default: \"center\".\r* trapId (string): The ID of the trap token. This is set automatically by the script.\r* victimId (string): The I of the victim token. This is set automatically by the script.\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [
        {
          "name": "theme",
          "type": "text",
          "default": "default",
          "description": "Which TrapTheme will be used for system-specific trap messages, effects, and passive searching? (Enter the theme's name provided in its README. E.g. \"5E-OGL\", \"5E-Shaped\", \"MLP-RIM-4\". \rSystem-specific themes must be installed separately from It's A Trap!.)"
        },
        {
          "name": "revealTrapsToMap",
          "type": "checkbox",
          "value": "true",
          "checked": "checked",
          "description": "When a trap with the bleeding-eye status is activated, it will be moved to the Map layer instead of the Objects layer."
        }
    ],
    "dependencies": ["Token Collisions", "Path Math", "Vector Math"],
    "modifies": {
        "chat": "write",
        "gmnotes": "read",
        "lastmove": "write",
        "layer": "read, write",
        "left": "read, write",
        "status_angel-outfit": "read",
        "status_bleeding-eye": "read",
        "status_cobweb": "read",
        "status_fluffy-wing": "read",
        "token": "read",
        "top": "read, write"
    },
    "conflicts": ["Blood and Honor"]
}
