{
    "name": "Path Splitter",
    "script": "PathSplitter.js",
    "version": "1.1",
    "previousversions": ["1.0"],
    "description": "# Path Splitter\r\r_Updates:_\r_v1.1:_\r* Pathsplitter now supports elliptical paths.\r* If a splitting path isn't selected, it will display a message in the chat with the current splitting color.\r* When the macro boots up, it installs a macro for its ```!pathsplit``` command.\r\rThis script allows players to split up a polygonal path by drawing another\rpolygonal path on top of it. The original path is split up where it intersects\rthe splitting path. This script also supports scaled and rotated paths.\r\r## To use:\r\r1) Draw a path over the path your want to split up. Set this path to\rthe splitting path color (by default this is pink: ```#ff00ff```).\r\r2) Select the path you want to split and the splitting path.\r\r3) In the chat, enter the command ```!pathSplit``` or activate the ```Pathsplitter``` macro installed with the script.\r\r## Changing the splitting path color:\r\rBy default, the reserved color for the splitting path is pink (```#ff00ff```).\rTo change it, set your splitting path to whichever color you want to use.\rThen, select it and enter the command ```!pathSplitColor``` in the chat.\r\r## Help\r\rIf you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature, please\rpost to the script's thread in the API forums or shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=newest&type=all&genre=all&author=Stephen%20Lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["Matrix Math", "Path Math", "Vector Math"],
    "modifies": {
        "path": "read, write"
    },
    "conflicts": []
}
