{"Source":"Monstershuffler.com","MythicActions":[],"Description":"Personality Trait Diminished\nThe Sorcerer who is a talented singer.","Player":"","Version":"3.2.10","ImageURL":"","Name":"Zumjeon","Type":"Medium Humanoid (male High Elf), Lawful Good","AC":{"Value":11,"Notes":""},"HP":{"Value":121,"Notes":"(22d8 + 22)"},"Speed":["walk 30 ft."],"Abilities":{"Str":14,"Dex":12,"Con":13,"Int":18,"Wis":11,"Cha":20},"Saves":[{"Name":"CON","Modifier":6},{"Name":"CHA","Modifier":10}],"Skills":[{"Name":"Insight","Modifier":5},{"Name":"Medicine","Modifier":5},{"Name":"Perception","Modifier":5},{"Name":"Persuasion","Modifier":10}],"DamageVulnerabilities":[],"DamageResistances":["psychic"],"DamageImmunities":[],"ConditionImmunities":["sleep"],"Senses":["darkvision 60 ft.","passive Perception 15"],"Languages":["Common","Deep Speech","Elvish","Infernal","Telepathy 30 ft."],"Challenge":"13","Traits":[{"Name":"Legendary Resistance (2/Day)","Content":"If Zumjeon fails a saving throw, he can choose to succeed instead."},{"Name":"Fey Ancestry","Content":"Zumjeon has advantage on saving throws against being charmed."},{"Name":"Trance","Content":"Zumjeon does not sleep. Instead he meditates deeply, remaining semi-conscious, for 4 hours a day."},{"Name":"Psionic Mind","Content":"Spells of the Enchantment school and spells that deal psychic damage require no verbal or somatic components for Zumjeon, and they require no material components unless they are consumed by the spell."},{"Name":"Sorcery Points","Content":"Zumjeon has 25 sorcery points that he can use to fuel the following abilities:\n- He can spend 2 sorcery points to use his Quickened Spell bonus action.\n- He can spend 1 sorcery point to reroll the d20 of a failed ability check.\n- He can spend 3 sorcery points to give a creature disadvantage on the saving throw of one of his spells.\n- He can spend a number of sorcery points equal to to the spell's level they are casting to make it target a second creature. To be eligible, a spell must be incapable of targeting more than one creature at the spell's current level."}],"Actions":[{"Name":"Mind Sliver","Content":"Ranged Spell Attack: +10 to hit,  range 60 ft, one target. Hit: 33 (8d6 + 5) psychic damage. Targets hit by this spell subtract 1d4 from the next saving throw they make before the end of Zumjeon's next turn."},{"Name":"Spellcasting","Content":"Zumjeon casts one of the following spells, using Charisma as the spellcasting ability (spell save DC 18, +10 to hit with spell attacks):\n\nAt will: mending, friends, prestidigitation, dancing lights4/day each: charm person, dissonant whispers, arms of hadar3/day each: dominate person, synaptic static, evard's black tentacles, black tentacles, water breathing, hunger of hadar, hold person, mind spike2/day each: psychic scream, dominate monster, reverse gravity, mental prison"}],"BonusActions":[{"Name":"Misty Step","Content":"Zumjeon teleports up to 50 feet to an unoccupied space that he can see."},{"Name":"Quickened Spell (2 Sorcery Points)","Content":"Zumjeon spends 2 sorcery points to cast a spell that has a casting time of 1 action as a bonus action."},{"Name":"Revelation in Flesh","Content":"Zumjeon unleashes the aberrant truth hidden within himself. Zumjeon gains one of the following benefits:\n- His body, along with any equipment he is wearing or carrying, becomes slimy and pliable. He can move through any space as narrow as 1 inch without squeezing, and he can spend 5 feet of movement to escape from nonmagical restraints or being grappled.\n-He gains a swimming speed equal to twice his walking speed, and he can breathe underwater. Moreover, gills grow from his neck or fan out from behind his ears, his fingers become webbed, or he grow writhing cilia that extend through his clothing.\n- He gains a flying speed equal to his walking speed and can hover. As he fly, his skin glistens with mucus or shines with an otherworldly light.\n- He can see any invisible creature within 60 feet of him, provided it isn't behind total cover. His eyes also turn black or become writhing sensory tendrils."}],"Reactions":[{"Name":"Shield","Content":"Zumjeon protects himself against an incoming attack with an invisible barrier of magical force. He gains a +8 bonus to AC until the start of his next turn, including against the triggering attack, and he takes no damage from magic missile."}],"LegendaryActions":[{"Name":"Quickened Spell (Costs 2 Actions)","Content":"Zumjeon casts a spell of 3rd level or lower from his list of spells."},{"Name":"Warping Implosion (Costs 3 Actions)","Content":"Zumjeon teleports to an unoccupied space he can see within 120 feet of him. Immediately after he disappears, each creature within 30 feet of the space he left must make a Strength saving throw, or take 16 (3d10) force damage and be pulled straight toward the space Zumjeon left, ending prone in an unoccupied space as close to his former space as possible. On a successful save, the creature takes half as much damage and isn't pulled."},{"Name":"Sorcerous Restoration","Content":"Zumjeon regains 3 sorcery points."}]}