{
    "name": "It's a Trap! - Pathfinder theme",
    "script": "TrapTheme.js",
    "version": "3.6.1",
    "previousversions": ["1.0", "1.1", "3.0", "3.1", "3.2", "3.3", "3.4.1", "3.5.1", "3.5.2", "3.6"],
    "description": "# It's A Trap! - Pathfinder Generic theme\r\r_3.6 Updates_\r\r* Implemented automatic character sheet detection.\r* User can also manually select which character sheet is being used in-game.\r* User can specify custom sheet and its attributes in-game.\r\rThis is a Pathfinder trap theme built to support all Pathfinder character sheets.\rBy default, it will automatically detect which character sheet you're using,\rbut if needed, you can also specify which sheet the script is using from the\rtheme-specific trap properties.\r\rThis currently supports the following Pathfinder character sheets:\r\r* Roll20\r* Community\r* Simple\r\r## Theme-specific properties\rThe following trap properties are specific to this trap theme script.\r\r### Character Sheet\rManually specify which character sheet your game is using. By default, this\rwill try to auto-detect your character sheet.\r\rYou can also specify that you are using a custom character sheet. If you do so,\ran additional property will appear under this one to specify the attribute\rnames used for the custom sheet.\r\r### Enable Passive Perception?\rSpecify whether to globally enable passive perception. Pathfinder doesn't normally\ruse passive perception, but the option is here for groups that want to use it.\rThis is set to 'no' by default.\r\r### Attack Roll\rThis property specifies the trap's attack roll modifier and which type of AC it\rtargets (normal or touch), if it makes an attack roll.\r\r### Damage\rA dice expression for the damage dealt by the trap on a hit. This does not\rtake any damage resistances or immunities into account.\r\r### Hide Save Result\rThis property specifies whether the result of the trap's saving throws will be\rhidden from the players.\r\r### Miss - Half Damage\rThis property specifies whether victims of the trap will still take half damage,\reven if they avoided the trap. This does not take into account any special\rabilities such as Evasion.\r\r### Saving Throw\rIf the trap allows a saving throw, choose which saving throw it uses with this\rproperty and specify the save DC.\r\r### Spot DC\rThis property specifies the passive Perecption (10 + Perception skill modifier)\rneeded for a character to passively spot the trap.\r\r## Trap Spotter ability\r\rFor built-in sheets, This Trap Theme supports the Rogue's Trap Spotter talent. It works for any\rcharacter that has Trap Spotter in the Class Abilities section of their\rcharacter sheet.\r\rWhen the character approaches within 10' of a trap, they will\rautomatically get a perception check to try to notice the trap. The results\rof this check are sent to the GM. If the Perception check is successful, the\rplayers are also alerted about the trap's presence.\r\rThis ability only works with traps whose type is 'trap'. For the character's\rPerception check, it uses their Perception skill total on their character sheet,\rso it doesn't take into account any situational bonuses. It is the GM's job\rto account for any situational bonuses that might contribute to the hidden\rPerception check when the result is displayed to them.\r\r## Help\r\rDue to complications with the API reading attributes from certain character sheets,\rthere have been issues in the past with things such as saving throws or passive perception\rnot being correct. If this happens, first try adjusting the values for these on\ryour character sheet or try re-creating the character sheet from scratch to see\rif that resolves the problem.\r\rMy scripts are provided 'as-is', without warranty of any kind, expressed or implied.\r\rThat said, if you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\rWhen messaging me about an issue, please be sure to include any error messages that\rappear in your API Console Log, any configurations you've got set up for the\rscript in the VTT, and any options you've got set up for the script on your\rgame's API Scripts page. The more information you provide me, the better the\rchances I'll be able to help.\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts,\rplease consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/search?category=itemtype:Art&author=Stephen%20Lindberg|Stephen%20L\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
