{
    "name": "It's a Trap! - Pathfinder theme",
    "script": "TrapTheme.js",
    "version": "3.1",
    "previousversions": ["1.0", "1.1", "3.0"],
    "description": "# It's A Trap! - Pathfinder theme\r\r_3.1 Updates_\r* The trap theme now supports the Rogue Trap Spotter ability.\r\rThis is a Pathfinder trap theme built to support Samuel Marino, Nibrodooh,\rVince, Samuel Terrazas, chris-b, Magik, and James W.'s Pathfinder character sheet.\r\r## Trap Spotter ability\r\rThis Trap Theme supports the Rogue's Trap Spotter talent. It works for any\rcharacter that has Trap Spotter in the Class Abilities section of their\rcharacter sheet.\r\rWhen the character approaches within 10' of a trap, they will\rautomatically get a perception check to try to notice the trap. The results\rof this check are sent to the GM. If the Perception check is successful, the\rplayers are also alerted about the trap's presence.\r\rThis ability only works with traps whose type is 'trap'. For the character's\rPerception check, it uses their Perception skill total on their character sheet,\rso it doesn't take into account any situational bonuses. It is the GM's job\rto account for any situational bonuses that might contribute to the hidden\rPerception check when the result is displayed to them.\r\r## Help\r\rDue to complications with the API reading attributes from certain character sheets,\rthere have been issues in the past with things such as saving throws or passive perception\rnot being correct. If this happens, first try adjusting the values for these on\ryour character sheet or try re-creating the character sheet from scratch to see\rif that resolves the problem.\r\rIf you continue to experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature, please reply to this thread:\rhttps://app.roll20.net/forum/post/3280344/script-its-a-trap-v2-dot-3\ror shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=newest&type=all&genre=all&author=Stephen%20Lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
