{
	"name": "D&D 5E - WildShape",
	"script": "WildShape.js",
	"version": "1.4.2",
	"previousversions": [
		"1.3.1",
		"1.3.2",
		"1.4.0",
		"1.4.1"
	],
    "description": "Easy shapeshift for your PCs/NPCs.Can be used for both PC and NPC to shape shift into either a PC or an NPC.\r\rAlt-double clicking on the shape shifted token will open the relative pc/npc sheet so that you can run actions from your new shape.\r\rAutomatically:\r\r* change the token size\r* set hp/ac/speed (or any other attribute you might want) on bar1/2/3 when you shapeshift\r* setup senses (e.g. light, vision) from darkvision/blindsight info on NPCs, can set defaults and overrides per shape\r* change roll settings on NPC sheet (when transforming from a PC) to never whisper, toggle advantage, don't autoroll damage\r* show journal entries to players for all their shapes\r* change the token to the last taken shape when dropping a new shifter token (e.g. from the journal or copy/paste, useful when moving between maps)\r\rAlso, for **Druids Only** it will automatically:\r\r* copy INT/WIS/CHA attributes to NPCs\r* set corrected saving throws and skills considering proficiencies according to 5e rules\r* check and decrease a configurable wild shape resource\r\rAdditional Features:\r* shapes can be mass imported from a journal folder\r* all data can be setup through chat menus.\r\rForum thread: https://app.roll20.net/forum/permalink/8856337/ \r\rFull documentation here: https://github.com/ocangelo/roll20/tree/master/WildShape\r\r## IMPORTANT NOTES:\r\r### Note 1:\r\rThere is a limitation on using images directly from the marketplace, whenever you want to use a monster from the Monster Manual (or similar external resource in your compendium) the API might give you an error.\r\rFor instance if you were trying this:\r\r* drag the token for your shapeshifter onto the Map\r* drag a monster from the compendium onto the Map (e.g. Ape)\r* go in the WildShape config for your shifter, click on Add NPC and try to add Ape from the list\r\rIt might fail because of the image with this error:\r\r`ERROR: WildUtils::duplicateCharacter (Ape -> Zanaphia - Ape): cannot find image on either token or avatar; if it's using a marketplace link the image needs to be re-uploaded into the library and set on the target character as either token or avatar image\r`\r\rIf you do get the error, this is a list of steps you can follow to fix it:\r\r* alt+double click on the Ape token (or open the character sheet from the Journal), go to Bio & info, right click on the avatar, save as... whatever you want on your pc, let's say ape.png\r* on that same Ape character sheet pop-up click on Edit on the top bar\r* remove current avatar\r* click on the upload button in the avatar section and select the ape.png you just saved\r* close the Ape character sheet\r* go in the WildShape config for your shifter, click on Add NPC and try to add Ape again from the list\r* everything should work just fine\r\r### Note 2:\r\rRight now I am using the token names to find shifters when they try to shapeshift, if you change it in your game you will have to edit it in the shifter settings otherwise they won't be able to transform anymore",
	"authors": "Angelo",
	"roll20userid": "6205674",
	"useroptions": [],
	"dependencies": [
		"WildHelpers"
	],
	"modifies": {
		"state.WILDSHAPE": "read, write",
		"character.*": "read, write",
    	"attribute.*": "read, write",
    	"token.*": "read, write",
    	"graphic.*": "read, write"
	},
	"conflicts": []
}