{
    "name": "One-Way Dynamic Lighting",
    "script": "script.js",
    "version": "1.0.2",
    "previousversions": [],
    "description": "# One-Way Dynamic Lighting\r\rThis script allows you to set up dynamic lighting walls that allow you to\rsee through one side, but not the other.\r\r### Creating Walls\r\rTo create a one-way dynamic lighting wall, you need to create a path for the wall itself and\ra filled path representing a area from which characters can see through the wall. Once you have those\rtwo objects created, select both of them, and activate the ```OneWayDynamicLighting``` macro installed\rby this script. That's all there is to it!\r\r__Note:__\rDue to limitations of the API, if at least one player character is on the visible\rside of the wall, then all characters will be able to see through it, even if\ryour dynamic lighting is set to require line-of-sight. This is because it works by\rmoving the one-way walls back and forth from the GM layer and the Dynamic Lighting layer,\rwhich at any point in time is the same for everyone.\r\rAlso, please note that this script only operates for character tokens that \rrepresent a character controlled by a non-GM player. This is intentional \rso that NPCs (particularly enemies) don't mess with the state of the one-way \rdynamic lighting walls.\r\r## Help\r\rMy scripts are provided 'as-is', without warranty of any kind, expressed or implied.\r\rThat said, if you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\rWhen messaging me about an issue, please be sure to include any error messages that\rappear in your API Console Log, any configurations you've got set up for the\rscript in the VTT, and any options you've got set up for the script on your\rgame's API Scripts page. The more information you provide me, the better the\rchances I'll be able to help.\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts,\rplease consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/search?category=itemtype:Art&author=Stephen%20Lindberg|Stephen%20L\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["Path Math"],
    "modifies": {},
    "conflicts": []
}
