{
	"name": "Exalted 3rd Edition Dice Roller",
	"script": "EX3Dice.js",
	"version": "1.0",
	"previousversions": [],
	"description": "A more robust dice rolling script for use with the Exalted Third Edition game system. It is capable of not only counting 10s as two successes (or not, at the user's discretion), but also keeping track of other doubled successes as the result of charms, as well as handling rerolls.\n\nThe script's API command is '!exr'. For a complete command reference, type '!exr -help'.\n\nThe form a basic roll command takes is as follows: '!exr [no. of dice]# [command1] [arg1],[arg2],[..] [command2] [arg3],[arg4],[...]'. The user does not have to specify the success threshold, as it's always 7 in Exalted.\n\nThe script will double 10s (that is, count 10s as two successes) by default, but if the user needs to double other number values, they can use the '-d' command (case sensitive; see below), followed by a comma-delimited list of die results to double (in addition to 10, which, again, is already counted). If the user needs to *prevent* the script from doubling 10s, they can pass '-D', followed by a list of any values they would like to double. The '-d' and '-D' commands behave almost identically, save that the first automatically doubles 10s, and the other does not.\n\nIf the player needs to limit the number of doubled results they may accrue (as in the descriptions of some charms), they can attach 'l' to the end of either double command, immediately followed by the maximum number of doubles from which they can benefit (e.g., '-Dl5 9,7' to get a roll that does not double 10s, but doubles 9s and 7s, and of which the script will only count up to 5 doubled results).\n\nSome other charms in Exalted award the player rerolls. Most of these rerolls allow dice of a specified value to be rerolled once, and many allow the keeping of the higher result. This is the default behavior of the reroll command '-r'. Like the double command, this should be followed by a comma-delimited list of results to be rerolled. Some other effects award a *recursive* reroll, which allows the player to \"reroll [x]s until [x]s fail to appear.\" This is accomplished with the '-R' command, which functions identically to the other version, save that it will continue to reroll the passed values until there are no more left.\n\nThe reroll commands also have an 'l' modifier, but this one is used in conjunction with the '-r' command to force the script to keep the newer result, regardless of which result is higher (e.g., '-rl 6,5' to reroll 6s and 5s once each, and keep the new result, regardless of whether or not is is lower than the first).\n\nI'll continue to try to add new features as I playtest this with my group, but that's all for now! Enjoy!",
	"authors": "Mike W. Leavitt",
	"roll20userid": "242034",
	"useroptions": [],
	"dependencies": [],
	"modifies": {},
	"conflicts": []
}
