{
	"name" : "Initiative Tracker Plus",
	"script" : "initiative_tracker_plus.js",
	"version" : "1.25",
	"description" : "**From Ken L's original Tracker Jacker script.**\r\rAn attempt to modernize Tracker Jacker and add new functionality as it becomes desired.  \r  \r**Change Log:**  \r* 2020-09-12 - Updated heavily to pull all token markers enabled in the campaign and make them useable for condition/status effects  \r* 2020-09-12 - Added -cleanSlate command (!itp -cleanSlate) to completely wipe all persistent state data should not be used lightly but if effects get stuck in the system this will clear them  \r* 2020-09-20 - Added EOT link to turn indicator  \r* 2020-09-20 - Added mouseover text to token marker selector list  \r* 2020-09-25 - Added the ability to display favorites alphabetically, it remains in the first in first out order by default.   To get an alphabetical list change `!itp -listfavs` to `!itp -listfavs 1`  \r* 2020-11-18 - Added the ability to save and load favorite.  The save creates a Handout called \"ITPFavsJSON\", the load looks for that handout and loads the JSON from it.\r* 2020-11-22 - The first actor's turn is now announced when starting the tracker.\r* 2020-11-22 - Added the ability to change the initiative indicator (spinning green thing by default) to any other image.\r* 2020-11-23 - Submit current codebase to Roll20's Script repository in the hopes of becoming a one-click API script.\r* 2020-11-23 - Updated initiative round indicator to have Play, Stop and Pause buttons instead of ? and ??\r* 2020-11-23 - Changed references to Tracker Jacker to Initiative Tracker Plus.  I am doing this to differentiate the new and drastically changing codebase from Ken L.'s original codebase so users that are happy with OG Tracker Jacker can continue to use it without confusion.\r\r* 2020-11-22 - The first actor's turn is now announced when starting the tracker.\r* 2020-11-22 - Added the ability to change the initiative indicator (spinning green thing by default) to any other image.\r* 2020-11-23 - Submit current codebase to Roll20's Script repository in the hopes of becoming a one-click API script.\r* 2020-11-23 - Updated initiative round indicator to have Play, Stop and Pause buttons instead of ? and ??\r* 2020-11-23 - Changed references to Tracker Jacker to Initiative Tracker Plus.  I am doing this to differentiate the new and drastically changing codebase from Ken L.'s original codebase so users that are happy with OG Tracker Jacker can continue to use it without confusion.\r* 2020-12-02 - Added a command to clear all statuses from a token.  `!itp -dispmultistatusconfig removeall` while the token(s) are selected, or a button appears on the edit message as well.\r* 2020-12-02 - Some minor code cleanup to make it easier for me to work with.\r* 2020-12-28 - Changed '? Round 1' (which changes to '?? Round 1' when paused) to use a play button image |> and pause button image || instead.\r* 2021-02-13 - Added -setConfig functionality to modify various fields, flags and design variables.  These changes will be stored in the state so should continue between sessions.  Use detailed below.\r\r\r**Commands:**  \r  \r***`!itp -help`***\rDisplay help message\r  \r***`!itp -start`***\rStart/Pause the tracker. If not started starts; if active pauses; if paused, resumes. Behaves as a toggle.\r  \r***`!itp -stop`***\rStops the tracker and clears all status effects.\r  \r***`!itp -clear`***\rStops the tracker as the -stop command, but in addition clears the turnorder\r  \r***`!itp -pause`***\rPauses the tracker.\r  \r***`!itp -reset [round#]`***\rReset the tracker's round counter to the given round, if none is supplied, it is set to round 1.\r  \r***`!itp -addstatus [name]:[duration]:[direction]:[message]`***\rAdd a status to the group of selected tokens, if it does not have the named status.\r**name** name of the status.\r**duration** duration of the status (numeric).\r**direction** + or - direction (+# or -#) indicating the increase or decrease of the the status' duration when the token's turn comes up.  +0 or -0 for a permanent affect.\r**message** optional description of the status. If dice text, ie: 1d4 exist, it'll roll this result when the token's turn comes up.\r  \r***`!itp -removestatus [name]`***\rRemove a status from a group of selected tokens given the name.\r  \r***`!itp -edit`***\rEdit statuses on the selected tokens\r  \r***`!itp -addfav [name]:[duration]:[direction]:[message]`***\rAdd a favorite status for quick application to selected tokens later.\r  \r***`!itp -listfavs`***\rDisplays favorite statuses with options to apply or edit.\r  \r***`!itp -listfavs 1`***\rDisplays favorite statuses (in alphabetical order) with options to apply or edit.\r  \r***`!eot`***\rEnds a player's turn and advances the tracker if the player has control of the current turn's token. Player usable command.\r  \r***`!itp -saveFavs`***\rSave your current Favorites into in the GM notes section of a handout called \"ITPFavsJSON\". This can be copy/pasted into a handout with the same name in another lobby and then \"!itp -loadFavs\" can be run to load them there.\r  \r***`!itp -loadFavs`***\rLoad Favorites previously saved via \"!itp -saveFavs\". Requires the handout \"ITPFavsJSON\" to exist and have properly exported data in the GM notes section.\r  \r***`!itp -setIndicatorImage`***\rReplaces the current initiative indicator with a new image\r**Note:** The token will be removed from the field, along with any others with the name 'tracker_image'\r* Place the image you wish to use as the indicator image (animated turn indicator) on the play field (any layer).  Please note, rollable tokens can be used for this as well.\r* Edit the new token and change it's name to 'tracker_image', save the change\r* Pause the tracker if it's currently active\r* Use this command\r* Unpause the tracker if it was active, else wise the next time the tracker is started your new indicator will be used.\r  \r***`!itp -defaultIndicatorImage`***\rRevert the initiative indicator to the original green one.\r* Pause the tracker if it's currently active\r* Use this command\r* Unpause the tracker if it was active, elsewise the next time the tracker is started the indicator will be the default green one.\r\r\r\r\r\r***`!itp -setConfig [key]:[value]`***\rChanges various configuration values.  Permitted keys and what they expect for values are:* trackerImgRatio - [2.25] - a decimal number, how much larger than the token it's highlighting that the turn indicator should be\r* rotation_degree - [15] - an integer number, how many degrees per step of the indicator animation that it rotates.\r* rotation_rate - [250] - an integer number, how many milliseconds between frames of the animation, smaller numbers are a faster animation but will load down roll20 more.\r* round_separator_initiative - [-100] - an integer number, displays the 'initiative' for the round separator 100 will put it at the top of the round, -100 will put it at the bottom of the round.\r* rotation - [true] - true or false, turns the spinning animation for the turn indicator on (true) or off (false)\r* rotation - [true] - true or false, displays or hides the EOT button when announcing an actor's turn in chat\r* turncolor - [#D8F9FF] - Hex color code, changes the color of the background of the chat message announcing who's turn it is.\r* roundcolor - [#363574] - Hex color code, changes the color of the round announcement chat message.\r* statuscolor - [#F0D6FF] - Hex color code, changes the color of the text of the chat message announcing statuses of the current actor.\r* statusbgcolor - [#897A87] - Hex color code, changes the background color of the chat message announcing statuses of the current actor.\r* statusbordercolor [#430D3D] - Hex color code, changes the color of the border of the chat message announcing statuses of the current actor.\r* statusargscolor [#FFFFFF] - Hex color code, changes the color of the feedback text when changing the marker for a status.\r* eotcolor [#FFFFFF] - Hex color code, changes the color of the EOT button.\r",
	"authors" : "Ken L., James C. (Chuz)",
	"roll20userid" : "4306461",
	"patreon" : "https://www.patreon.com/ChuzGaming",
	"useroptions" : [],
	"dependancies" : [],
	"modifies" : {},
	"conflicts" : [],
	"previousversions" : [
		"1.0"
	]
}