{
    "name": "It's a Trap! - D&D 5E Shaped theme",
    "script": "theme.js",
    "version": "1.1",
    "previousversions": ["1.0"],
    "description": "# It's A Trap! - 5th Edition (Shapedv2) theme\r\r_v1.1 updates:_\r* The theme now supports the 'fx' basic JSON property made available in It's A Trap! v2.3.\r\rThis is a D&D 5th edition trap theme for the It's A Trap! script, compatible with\rthe 5th Edition (Shapedv2) character sheet by Mlenser.\r\rIt provides support for D&D 5th edition mechanics to automate resolving trap\rattacks, saving throws, and passive searching.\r\rTo use this theme for the It's A Trap! script, enter \"5E-Shaped\" for the ```theme``` user option.\r\r## TrapEffect properties\r\rThis TrapTheme supports the following TrapEffect JSON properties in addition\rto all the basic TrapEffect JSON properties:\r* attack (int): The trap's attack roll bonus. Omit if the trap does not make an attack roll.\r* damage (string): The dice roll expression for the trap's damage. Omit if the trap does not deal damage.\r* hideSave (boolean): If true, then only the GM will see the saving throw rolled for the trap.\r* missHalf (boolean): If true, then the trap deals half damage on a miss.\r* notes (string): A reminder about the trap's effects, which will be whispered to the GM.\r* save (string): The saving throw for the trap. This can be one of 'str', 'con', 'dex', 'int', 'wis', or 'cha'.\r* saveDC (int): The saving throw DC for the trap.\r* spotDC (int): The DC to spot the trap with passive wisdom (perception). When a character spots the trap, its trigger area will be circled.\r\r### Example of use:\r\rHere are a couple of trap JSON examples to get you started:\r\r*Attacks vs AC*\r\r```\r{\r    \"attack\": 4,\r    \"damage\": \"2d8 + 6\",\r    \"message\": \"A pressure plate gives way and darts fire forth from hidden compartments in the walls!\",\r    \"notes\": \"If the character is hit, they also become poisoned.\",\r    \"spotDC\": 14\r}\r```\rThe above example will have the trap make an attack against the victim's AC with a +4 bonus to its attack roll.\rOn a hit it does 2d8+6 damage.\rThe \"notes\" field is a message that is whispered to the GM as a reminder about anything else that happens with the trap.\rThe \"message\" is shown to everyone when the trap is triggered to describe what the trap is, and any other flavor text associated with it.\rThe DC to spot the trap with passive perception is 14.\r\r*Requires Saving Throw*\r\r```\r{\r    \"damage\": \"8d6 + 8\",\r    \"fx\": \"explode-fire\",\r    \"message\": \"A magical glyph flashes to life and then erupts in a whirling storm of fire!\",\r    \"missHalf\": true,\r    \"notes\": \"The sound of the trap going off alerts the mindflayers in area K26.\",\r    \"save\": \"dex\",\r    \"saveDC\": 16,\r    \"sound\": \"explode\",\r    \"spotDC\": 20\r}\r```\rThe above example will have the victim make a dexterity saving throw against DC 16. For the \"save\" property, you can specifiy any of the following: \"str\", \"dex\", \"con\", \"int\", \"wis\", or \"cha\".\rThe trap deals 8d6+8 damage on a hit and has a passive perception DC 20 to spot it.\rThe \"missHalf\": true line tells the trap that it still does half damage on a miss.\rThe \"sound\" property specifies the same of a sound in your jukebox to play when the trap activates.\r\r\r## Notes on trap automation:\rThe theme's automated attacks and saving throws do not account for conditional\rmodifiers, Advantage, or Disadvantage. Players will need to apply those in an\rad hoc fashion.\r\rIf a trap deals damage, the theme will not automatically subtract\rthe damage from the character's hit points. Players will still need to do that\rthemselves after applying conditional modifiers to their AC/saves,\rapplying damage resistance, vulnerability, etc..\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
