{
	"name": "Ping Buddy",
	"script": "pingbuddy.js",
	"version": "0.0.7",
	"description": "## Ping Buddy\nPing Buddy adds some extra utilitiy to the ping pull function, beyond what you would get with a long press or a shift-long press.\n### Follow a Party Token\nIf you create a token and name it 'Party', or set the tooltip to the word 'Party', the screen will ping pull to the token whenever it is moved. This allows you to guide players around the map or across an overland map. The ping animataion is temporarily disabled. The circle animation is removed by temporarily setting the GM's player color to transparent, and then reverting it. It is possible if you make too many rapid movements in succession, it won't revert the color before running again and stick the GM color on transparent. If this happens, just re-assign the GM player color manually.\nIf you set the 'Party' token to be an invisible token (marking it with an aura only you can see), it allows you to center the player view to any area of the map without a visual cue.\nIf two or more party tokens are on the same page, the screen will ping pull only to the one that was last moved.\nAnother use would be a board or wargame where you want to call attention to the last piece moved. Just make sure 'Party' is in the nameplate or the Tooltip. More behaviors are explained below.\n### Tooltip Codes\nInstead of naming the token 'Party', you can set the token's tooltip to the word 'Party' for the same behavior, and name the token as you will. These will only work if the player is on the page with the player flag. Capitalization does not matter. There are four codes currently:\n- **Party:** Behavior is same as naming the token 'Party'. All players will follow the token without animation.\n- **Ping:** Behavior is same as naming the token 'Party', but all players will follow the token with animation.\n- **Pingme:** Token will pingpull only the controller. They will see animation, but no one else will be affected.\n- **Pingmesilent:** Token will pingpull only the controller. They will not see animation, and no one else will be affected.\n### Pull Players to the Start of a Page\nWhenever the player flag is moved to a page, all players on that page will immediately be ping pulled to the 'Party' token. The token may be moved to the gm layer if you wish, and players will be pulled to that part of the map. This is useful for encounter maps that don't start in the upper left corner.\n### Find a Token\n**Find My Token:** If a player types `!pingme` into chat, the screen will ping pull to the first token it finds that they control. If they control no tokens on the screen, the script will inform you. This is useful for large maps, or if a player loses track of their token in Dynamic Lighting or Fog of War.\n**Find token by name:** If you type a name after !pingme, separated by a space, the script will find the first occurrence on the page of a token with that name. Ex. `!pingme Bob` will ping pull the first token it finds named 'Bob'. Spaces and capitalization count.\nPingme commands will only work if the player is on the page with the player flag.",
	"authors": "Keith Curtis",
	"roll20userid": "162065",
  "modifies": [],
	"conflicts": [],
	"previousversions": ["0.0.7"]
}
