{
    "name": "Duplicate and add identifying number to Character and Token",
    "script": "DupCharToken.js",
    "version": "1.0",
    "previousversions": [],
	"description": "This script will duplicate a character sheet and tokens giving the new characters and tokens an identifying number and linking each new token to it's own individual new character sheet. This script is useful for those who want to create multiple copies of monsters because they prefer multiple character sheets to linking tokens as Mooks. Using an argument of 'clean' causes it to clean up (delete) numbered tokens and characters such as it creates.\r\r## Commands:\r\r```!DupCharToken <Number of tokens to create (defaults to 1)> <Start numbering from (defaults to 1)>```\r\r```!DupCharToken clean```\r\r## Examples:\r\rIf you select a token named 'Skel' that is linked to a character named 'Skeleton', and in the chat window enter```!DupCharToken 5```\r\rIt will make 5 new characters, identical to the original, named 'Skeleton 1' through 'Skeleton 5', and make 5 new tokens, identical to the original and stacked in the exact same location, named 'Skel 1' through 'Skel 5'. Each token will be linked to its corresponding character sheet in the exact same manor as the originals were linked.\r\rIf later on you select any token named 'Skel' or 'Skel (number)' and enter```!DupCharToken clean```\rIt will delete all tokens where the name is 'Skel (any number)' and all characters named 'Skeleton (any number)'. \rThe original token and character (without a number) will not be deleted.\r\r\r## Known bugs/issues:\r  If the avatar image of the character is not in a user library (i.e: it's a marketplace image or from the Monster Manual, or the like), due to limits placed upon the API, it can't set an avatar image. You will have to do that yourself.\r\rYou can add the following text to a macro\r```!DupCharToken ?{How many Duplicates|1} ?{Starting Number|1}```",
    "authors": "Chris Dickey",
    "roll20userid": "633707",
    "useroptions": [],
    "dependencies": [],
    "modifies": {
        "character": "read,create",
        "attribute": "read,create",
        "ability": "read,create",
        "graphic": "read,create",
        "token.bar1_link": "read,write",
        "token.bar2_link": "read,write",
        "token.bar3_link": "read,write"
    },
    "conflicts": []
}
