{
    "name": "Roleplaying is Magic 4E Dice",
    "script": "mlp_dice.js",
    "version": "1.1",
    "previousversions": [],
    "description": "# Roleplaying is Magic 4E dice\r\r*Dependencies*\r* Roleplaying Is Magic 4E character sheet - v1.1+\r\r*v1.1 Updates*\r* The script now has an API.\r* Compatible with the It's A Trap! MLP-RIM-4 theme.\r* Requires v1.1 of the Roleplaying is Magic 4E character sheet.\r\rThis is a script for rolling dice checks checks for the\r[Roleplaying is Magic: Season 4 edition](http://roleplayingismagic.com/),\ra popular fan-created tabletop RPG system based upon the world of\rMy Little Pony: Friendship is Magic and developed by Roan Arts.\r\r## Character sheet\r\rThis script is codependent with the [Roleplaying is Magic 4E character sheet](https://github.com/Cazra/roll20-character-sheets/tree/master/RoleplayingIsMagic_4E).\rIt can be used either by using the chat command documented in the script or\rwith the dice rolling buttons the character sheet's Skills section.\r\r## Using it as a chat command\r\rYou can use this script to roll dice checks for the RiM 4 system using the\rfollowing chat command:\r\r```\r!r {skill name} [+/- ad hoc Advantages/Drawbacks] [\"Any ad hoc notes about the skill roll\"]\r```\r\re.g. ```!r Stealth +1 \"+2 if hiding in a wooded area\"```\r\rThe skill name is case-insensitive and supports shortened names. For example\rinstead of rolling ```!r Spellcasting```, you can roll ```!r spell```.\r\r*Important:* In order to roll a skill check for a character, you must be currently\rspeaking as that character in the chat.\r\r## Help\r\rMy scripts are provided 'as-is', without warranty of any kind, expressed or implied.\r\rThat said, if you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/ada-l\r\rWhen messaging me about an issue, please be sure to include any error messages that\rappear in your API Console Log, any configurations you've got set up for the\rscript in the VTT, and any options you've got set up for the script on your\rgame's API Scripts page. The more information you provide me, the better the\rchances I'll be able to help.\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts,\rplease consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/publisher/165/ada-lindberg\r",
    "authors": "Ada Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": [],
    "modifies": {},
    "conflicts": []
}
