{
    "name": "Hexploration",
    "script": "Hexploration.js",
    "version": "1.1",
    "previousversions": ["1.0"],
    "description": "# Hexploration\r\r_v1.1 Updates:_\r* The script now has a chat menu interface.\r* Implemented script configurations for hex colors.\r* Implemented reveal distance configuration. When a token moves, it will also reveal hexes out to this distance.\r* Hexes can now be named. When the named hex is revealed, it will announce that it has been discovered in the chat.\r* Implemented inverted fill. This works like the ordinary polygon fill, except that every hex NOT in the selected polygons is filled instead.\r\rThis script allows GMs to draw a polygon on a hex-gridded map and fill in\reach hex inside that polygon with an opaque hexagon. It's great for hex-based\rmaps where the PCs must explore and discover each area hex by hex.\r\r## General Usage\r\rThis script's actions and configurations are accessible through its menu\rdisplayed in the chat (Visible only to the GM).\rTo open the script's menu, activate the 'Hexploration_menu' macro installed\rby the script.\r\rNote that this script only works for maps whose grid types are set to either\r'Hex (V)' or 'Hex (H)'. The opaque hexes will be aligned to the page's hex\rgrid.\r\rWhen you move a token representing a character into an area concealed by a hex,\rthe hex will be revealed. If the script's reveal distance is set greater than 0,\rthen adjacent hexes out to that distance (in hex units) will also be revealed.\r\rWatch https://raw.githubusercontent.com/Roll20/roll20-api-scripts/master/Hexploration/Hexploration.gif\rfor a short demo of the basics of how the script works.\r\r### Rendering Hexes\r\rTo create a hex-filled area, first draw one or more polygons containing the\rarea you want filled with hexes. Then select the polygons and press the\r'Fill Polygon' action from the script's menu. That's it!\r\r### Naming Hexes\r\rHexes can be named to represent locations that are concealing. The names of\rthe hexes will be shown on the GM layer, invisible to the PCs. When a named\rhex is revealed, it will announce that its location has been discovered in the\rchat.\r\rThere are two ways to name locations hidden by hexes:\r\rBefore rendering the hexes using the 'Fill Polygon' action, create named tokens\rwith the 'white-tower' status representing the locations you want to conceal\rwith the hexes.\r\rTo name a hex that's already been rendered, select the hex and set its name\rusing the 'Name Hex' action from the menu.\r\r## Actions\r\rThe script contains the following actions available from the script's chat menu:\r\r### Fill Polygon\r\rThis renders hexes within one more more polygon areas.\rSelect one or more polygons, then use this action to fill their areas with\rhexes.\r\r### Inverse Fill\r\rThis works like the 'Fill Polygon' action, except that it renders hexes\reverywhere on the page except inside the selected polygons' areas instead.\r\r### Name Hex\r\rThis allows you to name a hex after it has been rendered. Select the hex you\rwant to name, then use this action to specify a name for it.\r\r## Configurations\r\rThe script contains the following configurations that can be set from the\rscript's chat menu:\r\r### Hex Color\r\rThis allows you to specify the color, border color, and label color of hexes.\rThis must be set before the hexes are rendered.\r\r### Border Width\r\rThis sets the width of the border outlines on hexes. This must be set before\rrendering the hexes.\r\r### Reveal Distance\r\rThis specifies how far out (in units) hexes are revealed when a character\rtoken is moved.\r\r## Help\r\rIf you experience any issues while using this script or the trap themes,\rneed help using it, or if you have a neat suggestion for a new feature, please reply to this thread:\rhttps://app.roll20.net/forum/post/6179141/script-hexploration\ror shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=newest&type=all&genre=all&author=Stephen%20Lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "MatrixMath", "Path Math", "Vector Math"],
    "modifies": {},
    "conflicts": []
}
