{
  "name": "SpawnDefaultToken",
  "script": "SpawnDefaultToken.js",
  "version": "0.9",
  "description": "Spawns one or more default tokens for a given character, with various options for placement and token characteristics.\rFor full documentation (including many examples), see the forum thread for this script at:\rhttps://app.roll20.net/forum/post/9046603/anybody-wanna-beta-test-a-default-token-spawning-script-with-toys/?pageforid=9046603#post-9046603\r**Instructions**\r*Case 1: Selected token is the basis for spawn origin*\rTo use, select one or more tokens on the map, and call the script with at minimum the name of the "character" to summon. The following will simply spawn 1 of the default character tokens in the center of each selected token.\r`!Spawn --name|charName`\r*Case 2: Target token is the basis for spawn origin*\rInitial token selection is still required (as it is used for some defaults), but you can optionally cause the tokens to spawn at targeted token(s), with a little trickery. Roll20 has a standing bug that if both selected and target tokens are passed to an api script, the selected tokens are not retained. To get around this, after the initial call, the script will generate a chat button to prompt for a number of targets and will call itself again with the now complete set of information.\r`!Spawn --name|charName --targets|2`\rA **complete description of commands** is included below. Note: I put < > around each of the parameters for readability. Don't include < > for actual use.\r**!Spawn {{\r- **name| < charName >** //(REQUIRED) name of the character whose target we want to spawn\r- **targets| < # >** //Destination override. Instead of using selected token(s) as origin, use target token(s)\r- **qty| < # > //DEFAULT = 1. How many tokens to spawn at each origin point. MAX = 20\r//supports hardcoded and rollable table inline rolls such as [[ 1d6 ]] and [[ 1t[tableName] ]]\r- **offset| < #,# >** //X,Y pos or neg shift in position of the spawn origin point(s) relative to the origin token(s), in number of SQUARES\r//DEFAULT = 0,0  // (NOTE: a POSITIVE Y offset means LOWER on the map)\r- **placement| < option >** //How to arrange the tokens relative to the origin point (+ offset). Options are:\r   //**'stack'**: (DEFAULT) All tokens will be stacked on top of each other\r//   **'row'**: A horizontal row of tokens\r   //**'column,col'**: A vertical column of tokens\r   //**'surround'**: A clockwise spiral placement around origin token, starting at top  (NOTE: any supplied offset will be ignored)\r   //**'grid #'**: A square grid with "#" tokens per row. Raster left to right\r   //**'burst #'**: An expanding diagonal distribution of tokens starting "#" squares from the 4 origin token corners. Large qty will form an "X" pattern\r   //**'cross #'**= "evenly" distributed vert/horiz cross pattern, starting directly above origin by # squares. Large qty will form a "+" pattern\r- **size| < #,# >** //DEFAULT = 1,1 (X,Y) - How many SQUARES wide and tall are the spawned tokens?\r- **side| < # or rand>** //DEFAULT = 1. Sets the side of a rollable table token.\r   //**#**: Sets the side of all spawned tokens to '#'\r   //**'rand,random'**: Each spawned token will be set to a random side\r- **order| < option >** //The z-order of the token. (NOTE: a recent Roll20 "feature" will always put character tokens with sight above those without, so YMMV.)\r   //**toFront,front,top,above**: Spawn token moved to front\r   //**toBack,back,bottom,below**: Spawn token moved to back\r- **light| < #,# >** //Set light radius that all players can see.\r   //**For Legacy Dynamic Lighting (LDL):**\r      //First # is the total radius of the light (light_radius)\r      //Second # is the start of dim light (light_dimradius) (so: 10,5 will be 10 ft of total light, with dim radius starting at 5ft)\r   //**For Updated Dynamic Lighting (UDL):**\r      //First # is the radius of bright light (bright_light_distance)\r      //Second # is the additional radius of dim light (so: 10,5 will be 10ft of bright light + 5ft of dim light)\r- **mook| < yes/no >** //DEFAULT = false (the "represents" characteristic of the token is removed so changes to one linked attribute, e.g. hp, will not propagate to other associated tokens.\r   //If set to true, linked attributes will affect all tokens associated with that sheet\r- **force| < yes/no >** //DEFAULT = false. The origin point is by default relative to the geometric center of the origin token\r   //Origin tokens of larger than 1x1 may spawn tokens in between squares, which may be strange depending on the specific case\r   //Set to true in order to force the token to spawn in a full square\r- **sheet| < charName2 >** //DEFAULT = selected character. The character sheet in which to look for the supplied ability\r   //useful if the ability exists on a "macro mule", etc.\r- **ability| < abilityName >** //The ability to trigger after spawning occurs. With caveats as described in the forum thread\r- **fx| < type-color >** //Trigger FX at each origin point.\r   //Supported types are: **bomb,bubbling,burn,burst,explode,glow,missile,nova,splatter**\r   //Supported colors are: **acid,blood,charm,death,fire,frost,holy,magic,slime,smoke,water**\r- **bar1| < currentVal/optionalMax >** //overrides the token's bar1 current and max values. Max is optional. If overridden, bar1_link will be removed\r- **bar2| < currentVal/optionalMax >** //overrides the token's bar2 current and max values. Max is optional. If overridden, bar2_link will be removed\r- **bar3| < currentVal/optionalMax >** //overrides the token's bar3 current and max values. Max is optional. If overridden, bar3_link will be removed\r- **expand| < #frames, delay >** //Animates the token during spawn. Expands from size = 0 to max size\r   //**#frames:** how many frames the expansion animation will use. Start with something like 20\r   //**delay:** how many milliseconds between triggering each frame? Start with something like 50. Any less than 30 may appear instant\r**}}**",
  "authors": "David M.",
  "roll20userid": 3987469,
  "patreon": [],
  "useroptions": [],
  "dependencies": [],
  "modifies": {       
    "character.*": "read",
    "graphic.*": "read,write",
    "ability.*": "read",
    "player.displayname": "read"
  },
  "conflicts": [],
  "previousversions": [
     "0.0",
     "0.1",
     "0.2",
     "0.3",
     "0.4",
     "0.5",
     "0.6",
     "0.7",
     "0.8"
  ]
}
