{
    "name": "5e Shaped Companion Script",
    "script": "5eShapedCompanion.js",
    "version": "1.1.2",
    "previousversions": [
        "1.1.1",
        "1.1.0",
        "1.0.3",
        "1.0.2",
        "1.0.0"
    ],
    "description": "[![Build Status](https://travis-ci.org/symposion/roll20-shaped-scripts.png)](https://travis-ci.org/symposion/roll20-shaped-scripts)\\n\n# Roll20 Shaped Character Sheet Companion Script\nThis is a script designed for use with the API on the [Roll20 Virtual Table Top](http://roll20.net). This script is\nspecifically designed to provide services and enhancements for the\n[5e Shaped Character Sheet](http://github.com/mlenser/roll20-character-sheets/tree/master/D%26D_5e_Reshaped) by Roll20 user Kryx. It **will\nnot work** with any other character sheet such as the Roll20 5e OGL character sheet. If you report bugs/ask for\nhelp while trying to use the script with a different character sheet you will be ignored with extreme prejudice!\n\n\n# Key features\n* Automatically create characters from Monster Manual statblock text\n* Import spells to characters from user-created databases of spells in JSON format\n* Import monsters from user-created databases in JSON format\n* Automatic population of NPC spells from JSON (if present) on import (both JSON and statblock)\n* Auto HP rolling on drop for monster tokens\n* Token setup with configurable defaults on monster import\n* Auto ammo decrement\n* Auto death save increment\n* Auto HD reduction/HP increase on HD roll\n* Advantage tracking commands - set a character to have (dis)advantage and mark which tokens this applies to\n* Commands to create token actions for new characters\n\n# Setup\n## Prerequisites:\n* You, or the person who created your game, must be a **Pro** subscriber to Roll20 to use this script.\n* You should be familiar with [how to use roll20](https://app.roll20.net/editor/tutorial), have a basic understanding\n of how to [configure a game](https://wiki.roll20.net/Game_Management) on Roll20,\nincluding setting up [character sheets](https://wiki.roll20.net/Character_Sheets) and installing API scripts. If you've\nonly just started using Roll20 and haven't found your feet yet, setting this script up and using it is probably a bad\nplace to start - it's an advanced tool, many of whose features presume a good working understanding of standard Roll20\ncapabilities. Play around with a simple campaign first, get used to making characters, working with tokens, and using\n the 5e Shaped Character Sheet manually; and then come back here for power-user goodness.\n* You should have a recent version of the 5e Shaped Character Sheet. If you are installing it from the list on the game\nsettings page, it's under Dungeons & Dragons, and at the time of writing it's called 5th Edition (Shapedv2). If you\nwant the version of the sheet with all the very latest fixes and features, you can install it directly from\n[Kryx's Github](http://github.com/mlenser/roll20-character-sheets/tree/master/D%26D_5e_Reshaped). Instructions for\nhow to do this can be found on the thread on the [character sheets forum](https://app.roll20.net/forum/category/277980)\n- the threads change frequently but at the time of writing the latest one was\n[here](https://app.roll20.net/forum/post/3212109/5e-shaped-2-dot-3-2-plus)\n\n## Installation\n1. Open the [raw text of the script](https://raw.githubusercontent.com/symposion/roll20-api-scripts/shaped-sheet-update/5eShapedCompanion/latest/5eShapedCompanion.js)\n1. Copy all the text - **Ctrl-A** followed by **Ctrl-C** (or **Cmd-A**, **Cmd-C** on a Mac)\n1. Got to the API scripts page for your campaign\n1. Paste the text into a new script, and then give it a sensible name in the box at the top - e.g. \\\"5e Shaped Companion\"\n1. Hit save\n1. When the page refreshes, check the console box at the bottom of the page to make sure that there are no errors. If\n everything has worked you should see a line that looks a bit like:\n `\"ShapedScripts 1460893071206 INFO :   -=> ShapedScripts v0.8.3 <=-\"`. If you see a line that includes the text\n `ERROR` then Something Bad Has Happened and you should ask for help on the API scripts forum if you can't work the\n problem out for yourself from the error message (sometimes they are even helpful, I promise!)\n\nYou are now set up and should be able to use the script as detailed below.\n\n## Updating\nSometimes a new version of the script comes out. If you have installed the script according to the instructions\nabove, you will need to update it manually when this happens. The process is exactly the same as installing the\noriginal, except that when you paste the script into your campaign, you should **replace** the script text of\nthe previous version rather than installing a new one. This is very important, because if you end up with two different\nversions of the script running at the same time, Bad Things Will Happen.\n\n## Optional Extras\nSome of the script commands allow you to import spells or monsters from custom data files. This can be useful for\nthings that aren't in the SRD, or for custom stuff created by other people. Creating these custom data files is\nbeyond the scope of this README at the moment, but you may find pre-made files floating around on the internet made\nby other people. These should be script files that end in .js (**not .json**), and you install them in exactly the\nsame way that you install the main script. If it worked, you should see some lines like this in your API log:\n```\n\"ShapedScripts 1460893071585 INFO : Summary of adding entities to the lookup: {\\\"errors\\\":0,\\\"monsters\\\":{\\\"withErrors\\\":0,\\\"skipped\\\":0,\\\"deleted\\\":0,\\\"patched\\\":0,\\\"added\\\":558}}\"\n```\nSend me a private message [here](https://app.roll20.net/users/791452/lucian) if you want some more guidance on\nfinding and installing useful extras.\n\n# Usage\n## Import a Monster from Monster Manual Statblock text\nYou first of all need a statblock from somewhere - generally speaking people get these from PDFs of adventures, or\nperhaps an OCRed copy of the Monster Manual. The statblock must conform to the layout conventions used by WotC for their\n5e products or it will not work; fortunately most published material respects these conventions. Once you have statblock,\nfollow these steps:\n\n1. Create/find a token to represent your monster/character, and place it on the tabletop\n1. Open the token settings\n1. Paste your statblock into the GM notes for the token. Make sure that you haven't lost all of the linebreaks - the\nRoll20 text editor controls can be a bit funny about line-endings. Sometimes I have to paste the text into a text editor\nfirst, and then copy it out of there before I paste it into Roll20. It should look roughly like the original you copied\nit from, minus all the formatting. At this stage you might also want to check that it's not completely garbled, if e.g.\nit comes from an OCR scan of a print book. The script will fix a lot of mistakes, but it's still only a script - if the\ntext is totally garbled you may need to fix some of the mistakes manually.\n1. When you're done, come out of the token editing and select the token.\n1. Type **!shaped-import-statblock** into the chat window and hit enter.\n1. You should see a message in the chat window, and end up with a new character in the journal. If you see an error\nmessage at this point you may need to fix up some problems with the text of the statblock\n1. Open the new character; you will be presented with the option to cancel or import, click import (this stage seems\nredundant, but it's working around a Roll20 limitation unfortunately)\n1. After a few seconds (be patient) all the attributes of your new character should be populated.\n1. Click the edit button at the top right of the character sheet dialog, and then click 'Use selected token\" in the\n\"Default token\"  box (Unfortunately it is not possible to automate this step either as things stand)\n1. Save\n\nYour new monster is now ready for use!\n\n### Notes on Statblock Text\nThe script does its best to fix up errors in the text and be tolerant of variances in layout, but there are some things\nthat it absolutely requires to be correct:\n* Character/monster name needs to be on its own line at the beginning\n* Sections headers like \"Actions\" and \"Reactions\" need to be the last thing on a line to be recognised (and preferably\n on a line on their own, although the parser usually deals with this ok)\n* Trait and action names need to be title case and end with a full stop, like in the MM.\n* Don't paste in descriptions at the bottom of the statblock - just the statblock proper. This is because actions can\nbe multiline and there is no way of telling where a final multiline action ends and a description begins (see e.g.\nPriest in the MM - don't paste the final description paragraph in)\n\n## Importing Monsters from a Custom Database\n_Please see above for details about installing a custom database_\n\n1. Find a token for your new monster and place it on the tabletop\n1. Select the token\n1. Type **!shaped-import-monster --Lich** into the chat window and hit enter, replacing 'Lich' with the name of the\nmonster you want to import. Obviously the monster name must match something in your custom database. If you're not\nsure what names are present in the database, or exactly what spelling is being used, you can run\n**!shaped-import-monster** on its own and it will show a button that will launch a select list of all the available\nmonsters.\n1. You should see a message in the chat window, and end up with a new character in the journal.\n1. Open the new character; you will be presented with the option to cancel or import, click import (this stage seems\nredundant, but it's working around a Roll20 limitation unfortunately)\n1. After a few seconds (be patient) all the attributes of your new character should be populated.\n1. Click the edit button at the top right of the character sheet dialog, and then click 'Use selected token\" in the\n\"Default token\"  box (Unfortunately it is not possible to automate this step either as things stand)\n1. Save\n\nYour new monster is now ready for use!\n\n## Importing Spells from a Custom Database\n_Please see above for details about installing a custom database_\n\n1. Select a token that represents a character\n1. Type **!shaped-import-spell --Fireball, Cure Wounds** into the chat window and hit enter, replacing the spell\nnames with whatever spells you want to import. If\nyou're not sure what spells are available, run **!shaped-import-spell** on its own to see a list.\n1. You should see a confirmation message in the chat window\n1. Open the character sheet for the character in question\n1. Click \"Import\" to complete the import\n\nYour new spells are now ready for use!\n\n## Tracking advantage using the script\n1. Configure your characters with the \"Normal\" roll option in the character sheet options (see later on for details\nof how to ensure that this is set automatically for characters imported with the script)\n1. Run **!shaped-config** from the chat window, click on 'Advantage Tracker' and then set 'Show Markers' to 'on' if\nit isn't already\n1. During play, when a character should have advantage or disadvantage, select their token and run **!shaped-at\n--advantage** from the\nchat window to give them advantage. Replace **--advantage** with **--disadvantage** or **--normal** for\ndisadvantage/normal respectively.\n1. When a character has advantage, all tokens representing it will be marked with a green dot. For disadvantage, the\ndot will be red\n\n**IMPORTANT NOTE:** Advantage/disadvantage is a per-character setting, not per-token. If you have monster characters\nfor which many tokens appear on the map at once (e.g. a horde of goblins), they will all get (dis)advantage at the\nsame time - so don't forget to turn it off when you're finished with the token if it's only supposed to apply to one!\n\n## Creating token actions for characters\nIt can be useful to create token action buttons for your characters to allow quick access to commonly used attacks,\nspells, actions, etc. For this you need to use the **!shaped-abilities** command. For example, **!shaped-abilities\n--attacks** will create a token action for each attack defined for your character. For full details of all the\navailable options, please see [below](#shaped-abilities)\n\n## Decrementing ammo\nThe script will automatically decrement ammo providing that the information is filled in correctly on the character\nsheet and the use ammo automatically option is turned on in the sheet options. See the character sheet documentation\nfor more information.\n\n## Death saves, Hit Dice\nThe script will automatically decrement hit dice and apply regained HP when you roll them from the character sheet.\nYou can turn this off in the [configuration](#configuration). When you roll a death save, it will add it to your death\nsave successes/failures automatically, unless you have the roll 2 option on for your sheet rolls (since it won't know\n whether you succeeded or failed!)\n\n## Roll HP for monsters\nYou can configure one of your token bars to represent HP by default in the script [configuration](#configuration). If\n you do this, and enable the 'Roll HP on Drop' option, the script will automatically Roll HP for any character whose\n default token doesn't have a linked attribute for the specified bar. PCs and important individual NPCs should have\n their HP bar linked directly to the character sheet in their token setting, since they are individuals with a single\n  HP value. Generic monsters ('mooks') should not have their HP bar linked to a character sheet attribute, however,\n  since there can be several individuals all sharing a single character sheet. For these monsters, the script will\n  automatically roll HP and apply it to a new token whenever you drag the character from the journal onto the table\n  top. If you would prefer to have a static HP value for your mooks, you should disable this feature in the script\n  configuration and set the HP value for the token manually before setting it as the default token for your character.\n\n# Full command list\n## !shaped-import-statblock\nImports details from a text statblock into a Roll20 character. The statblock must be inserted into the GM notes field\n of a token (_not_ a character!) and the token must be selected before running this command. The imported character\n will be configured with the default settings that you specify in the\n [default character settings configuration](#new-characters) . In addition the tokens you use will be\n configured according to the [default token settings configuration](#token-defaults) ready to be set as the\n default token for the character.\n\n###Options\n * **--overwrite** if the selected token already represents a character in the journal, the import will fail\n to avoid accidentally overwriting data, unless you supply this option to confirm that you wish to do so.\n * **--replace** if there is already a character in the journal with the same name as the one you are importing, the\n import will fail, whether or not the current token represents that character. This is to avoid creating loads of\n duplicates by mistake, which is almost never what you want to do. If you supply **--replace** the script will\n overwrite any character with the same name, unless there is more than one, in which case it will fail rather than\n risking overwriting the wrong one. Note that **--replace** implies **--overwrite**.\n\n###Selection\nYou must have at least one token selected. If you have more than one, it will attempt to import a statblock from each\n one in turn. When importing, each token will be set to represent the newly created character for it, and the script\n will also attempt to set the avatar for the character to be the token graphic<sup>[1](#avatar-note)</sup>.\n\n## !shaped-import-monster\nImports details of named monsters from a database of custom monsters loaded as a separate script. If run with no\noptions, this command will display a chat window button that allows you to launch a select list of all available\nmonsters to choose from. The imported character will be configured with the default settings that you specify in the\n [default character settings configuration](#new-characters) . In addition the tokens you use will be\n configured according to the [default token settings configuration](#token-defaults) ready to be set as the\n default token for the character.\n\n###Options\n * **--<monster name>** (e.g. **--Lich**) specifies a monster to import. You may supply multiple monsters as separate\n  options, or you may supply multiple in one option separated by commas (**--Ghoul, Zombie, Ghost**)\n * **--overwrite** if the selected token already represents a character in the journal, the import will fail\n to avoid accidentally overwriting data, unless you supply this option to confirm that you wish to do so.\n * **--replace** if there is already a character in the journal with the same name as the one you are importing, the\n import will fail, whether or not the current token represents that character. This is to avoid creating loads of\n duplicates by mistake, which is almost never what you want to do. If you supply **--replace** the script will\n overwrite any character with the same name, unless there is more than one, in which case it will fail rather than\n risking overwriting the wrong one. Note that **--replace** implies **--overwrite**.\n\n###Selection\nYou may no or 1 tokens selected when running this command:\n\n* If you have no tokens selected, this command will just add the new characters to the journal.\n* If you have 1 token selected, and you are importing one monster, the script will attempt to use the token image as the\navatar for your new character<sup>[1](#avatar-note)</sup>, and will also set the token to represent the newly created character\n* If you have 1 token selected and you are importing more than one monster, the script will only attempt to use the\ntoken image as the avatar for your new character<sup>[1](#avatar-note)</sup>.\n\n<a name=\"avatar-note\"/><sup>1</sup> Note that avatars will ony successfully be set for token images from your library, not marketplace or web content. This is due to security restrictions within the Roll20 platform. If you really want an image as a character avatar, please unpload it to your library and then create a token from it before doing your import.\n\n## !shaped-at\nGives the selected character advantage or disadvantage, or  neither.\n\n###Options\n* **--advantage** give the selected character advantage\n* **--disadvantage** give the selected character disadvantage\n* **--normal** clears (dis)advantage status for the selected character\n\n###Selection\nYou must select at least one token that represents a character. The specified setting will apply to the characters of\n all selected tokens.\n\n## !shaped-abilities\nCreates token actions for your character as shortcuts to a variety of rolls and other actions from the sheet.\n\n###Options\n* **--attacks** - create an ability for each attack present in the character sheet\n* **--traits** - create an ability for each trait present in the character sheet\n* **--traits-macro** - create an ability to launch the chat window traits buttons\n* **--actions** - create an ability for each action present in the character sheet\n* **--actions-macro** - create an ability to launch the chat window actions buttons\n* **--reactions** - create an ability for each reaction present in the character sheet\n* **--reactions-macro** - create an ability to launch the chat window reactions buttons\n* **--legendaryactions** or **--legendarya** - create an ability for each legendary action present in the character sheet\n* **--legendaryactions-macro** - create an ability to launch chat window legendary actions buttons\n* **--lairactions** or **--laira** - create an ability to launch chat window lair actions buttons\n* **--regionaleffects** or --regionale - create an ability to launch chat window regional effects buttons\n* **--initiative** - create an ability to roll initiative\n* **--saves** or **--savingthrows** - create an ability to launch the chat window save buttons\n* **--savesquery** or **--savingthrowsquery** - create an ability to launch the save drop-down query\n* **--abilitychecks** or **--abilchecks** - create an ability to launch the chat window ability check buttons\n* **--abilitychecksquery** or **--abilchecksquery** - create an ability launch the ability check drop-down query\n* **--statblock** - create an ability to launch a chat window statblock display\n* **--DELETE** - delete all abilities on the token (including those not created by this script)\n\nIn addition, you can pass the names of spells like **--Fireball** to create token actions for each spell. Obviously\nthe character in question must actually have this spell in its spellbook for this to work.\n\n###Selection\nYou must have at least one token that represents a character selected for this command to work. If you have multiple\ncharacters selected you cannot specify spells in the options since the different characters may have different spells.\n\n## !shaped-config\nDisplay configuration UI to change default behaviours. The significance of all the options is detailed\n[below](#configuration)\n\n## !shaped-token-defaults\nApply the same defaults that are used when setting up tokens on import to whatever tokens are currently selected.\nUseful for mass-configuring manually created tokens. See [below](#config-token-settings) for more details on what these\noptions are.\n\n#Configuration\n##Advantage Tracker\n* **Show Markers** If this is 'on', all tokens for a character will be marked with a green or a red dot if they have\nadvantage or disadvantage respectively. Designed for use with the [!shaped-at](#shaped-at) command\n\n##Token Defaults\n* **Numbered Tokens** If this is 'on', new tokens will have %%NUMBERED%% appended to their name to work with Aaron's\nTokenNameNumbered script. Please search for this on the API forum for more details.\n* **Show Name Tag** If this is 'on', the token will show its name tag to anyone who has permission to see it\n* **Show Name to Players** If this is 'on', and **Show Name Tag** is also 'on', players will be able to see the\ntoken's name.\n* **Bar X Attribute** Set this to the name of a sheet attribute (e.g. HP, AC, speed) to automatically set the\nspecified token bar/bubble to the value of this attribute\n* **Bar X Link** If this is 'on' then the specified bar/bubble will be _linked_ to the configured attribute on the\ncharacter\n sheet, i.e. changes to the bar/bubble will update the value on the character sheet. This is generally a good idea for\n everything except HP for generic tokens.\n* **Bar X Set Max** If this is 'on' then the specified bar will be given a maximum value (which will initially be the\n same as the main bar value) and will consequently display as a bar above the token as well as a value in the\n 'bubble'. Mainly useful for HP.\n* **Bar X Show Players** If this is 'on' then the specified bar/bubble will be shown to everyone, otherwise it will only\nbe visible to the GM and controlling players\n* **Auras** Sets up default auras for new character tokens. If you specify a range, new characters will have an aura\nwith the specified size, colour and shape\n* **Light Radius** Default light radius emitted from token\n* **Dim Radius** Start of dim light within the above-specified light radius\n* **Show other players** Whether light emitted from the token is visible only to the controlling player(s) or to all\nplayers\n* **Has Sight** If 'on' then controlling players will be able to see areas of maps with dynamic lighting enabled\nbased on the position of this token\n* **Light angle** Emitted light will be cast in arc this many degrees wide.\n* **LOS angle** the token's vision will be limited to an arc this many degrees wide\n* **Light multiplier** The multiplier affects how far the token can see from existing light sources. This is a good\nway to simulate a character who has the ability to see further than normal in low light situations or has an alternate\nform of vision that might allow them to navigate in the dark. For example, someone who can see twice as far in low light\nwould have a multiplier of two.\n\n##New Characters\n* **Sheet Output** Set whether output from the new character sheet should be public or whispered to the\ncontrolling player by default\n* **Death Save Output** Same as Sheet Output, but specifically for death saves\n* **Initiative Output** Same as Sheet Output, but specifically for Initiative rolls\n* **Show name on Roll Template** If 'on', the character's name will be shown on all their rolls in chat\n* **Roll Options** How are d20 rolls handled by default:\n** Normal: Roll one die only\n** Roll with Advantage: Roll two dice, display the highest value\n** Roll with Disadvantage: Roll two dice, display the lowest value\n** Roll 2: Roll two dice, display both results\n* **Init Roll** Same as above, but only applies to Initiative rolls. There is no Roll 2 option in this case because\ninitiative must have a single value to be sent to the turn tracker\n* **Init to Tracker** If 'on', automatically send all initiative rolls to the turn tracker.\n* **Break Init Ties** If 'on', the value a character's initiative bonus will be divided by 100 and added\nto their initiative roll to break initiative ties (matching rolls mean the character with the highest bonus goes first)\n* **Show Target AC** If 'on', all attacks and spells with a target will require a target to be clicked and will\ndisplay the target's AC on the Roll output\n* **Show Target Name** If 'on', all attacks and spells with a target will require a target to be clicked and will\ndisplay the target's character name on the Roll output\n* **Auto Use Ammo** If 'on', new characters will be set to automatically decrement ammo when launching\nattacks that are configured with ammo.\n",
    "authors": "Lucian H.",
    "roll20userid": "791452",
    "useroptions": [],
    "dependencies": [],
    "modifies": {
        "state.ShapedScripts": "read,write",
        "token.*": "read,write",
        "character.*": "read,write",
        "attribute.*": "read,write"
    },
    "conflicts": []
}