{
  "name": "Slide Tokens",
  "script": "Slide Tokens.js",
  "version": "1.2",
  "previousversions": ["1.1", "1.0"],
  "description": "Move tokens with an API command, while showing the path and waypoints as though it had been moved manually. The !mode command (GM-only) can change the unit type used by the !movetok command, or it will display the current mode if no argument (or an argument it doesn't understand) is given. !movetok accepts any number of arguments, separated by spaces. Each argument takes the form of [direction:]coordinate[,coordinate]; the direction and second coordinate are optional. Both coordinates should be numbers, but may be either positive or negative, and may used fractional values. Possible directions are absolute (alias: a), left (aliases: l, x), top (aliases: t, y), right (alias: r), bottom (alias: b) top-left (aliases: tl, xy), top-right (alias: tr) bottom-left (alias: bl), or bottom-right (alias: br). An 'absolute' direction will move the selected token(s) directly to the specified coordinates, using the top-left corner of the map as (0,0), while all other directions move the token(s) relative to their current positions. The top, right, bottom, and left directions will ignore the second coordinate if it is supplied. Other directions will treat the second coordinate as 0 if it is not supplied. Omitting the direction component of an argument is equivalent to using top-left. Coordinates are in terms of grid squares in the SQUARES mode, in terms of map measurement units in the UNITS mode, and pixels in the ABSOLUTE mode. If the page's grid size is 1, each grid square is 70 pixels. If the grid size is 0 (such as the grid being turned off), SQUARES mode will not move the token.",
  "authors": "Brian Shields",
  "roll20userid": "235259",
  "patreon": "https://www.patreon.com/bshields",
  "useroptions": [
    {
      "name": "Mode",
      "type": "selectoption",
      "options": ["SQUARES", "UNITS", "ABSOLUTE"],
      "default": "SQUARES",
      "description": "Control how coordinate arguments to the !movetok command are interpreted. The GM can also change this value during the game with the !mode command."
    }
  ],
  "dependencies": ["splitArgs"],
  "modifies": {
    "player.displayname": "read",
    "path.width": "read",
    "path.height": "read",
    "path.top": "write",
    "path.left": "write",
    "path.scaleX": "write",
    "path.scaleY": "write",
    "path.layer": "write",
    "token.pageid": "read",
    "token.top": "read,write",
    "token.left": "read,write",
    "token.lastmove": "write",
    "page.snapping_increment": "read",
    "page.scale_number": "read",
    "state.bshields.translateToken": "read,write"
  },
  "conflicts": []
}
