{
    "name": "Marching Order",
    "script": "marchingOrder.js",
    "version": "2.4",
    "previousversions": ["2.0", "2.1", "2.2", "2.3"],
    "description": "# Marching Order\r\r_v2.4 Updates_\r* Code refactored into modules.\r\rThis script allows you to select tokens and tell them to follow each other\rin some specified marching order.\r\r### To set one token to follow another\r\rSelect the token that will be the follower.\rFrom the menu, click the 'Follow' button. You will then be prompted to click\rthe token that will be the leader.\r\rYou can use this method consecutively for pairs of leader/follower\rtokens to specify a chain of tokens to be in some marching order.\r\r### To specify several tokens making up a marching order\r\rArrange the tokens in order from west to east, east to west, south to north,\ror north to south.\r\rSelect all the tokens that will be in the marching order.\r\rIn the menu, click 'North', 'East', South', or 'West'.\r\rFor 'North', the northmost token will be the leader in the marching order\rand the southmost token will be the caboose. The same pattern follows for\rthe other cardinal directions.\r\r### To make tokens stop following each other\r\rJust manually drag-and-drop the token out of the marching order.\rThey will step out of line in the marching order, but the rest of the\rmarching order will be unaffected. If a token was following the token\rthat stepped out of line, they will instead follow the token that the token\rwhich stepped out of line was following.\r\rTo stop all tokens from following each other, click the Stop All Following\rbutton in the menu.\r\r### Default marching order\r\rFrom the menu, you can also set a reusable default marching order and apply it\rto the current players' page.\r\rTo set a default marching order, select the leader token in an active\rmarching order and click the Set Default button from the menu. Each token\rin the marching order must represent a character.\r\rTo apply the saved default marching order to the current player ribbon page,\rclick the Use Default button from the menu. If a character from the default\rorder is missing from the current page, they will be skipped, but the rest\rof the marching order will be applied.\r\r## Help\r\rIf you experience any issues while using this script or the trap themes,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\ror create a help thread on the Roll20 API forum\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts, please consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/search?category=itemtype:Art&author=Stephen%20Lindberg|Stephen%20L\r\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": {},
    "modifies": {
        "left": "read, write",
        "rotation": "read, write",
        "token": "read",
        "top": "read, write"
    },
    "conflicts": []
}
