{
    "name": "Areas of Effect",
    "script": "aoe.js",
    "version": "1.2.1",
    "previousversions": ["1.0", "1.1", "1.2.1"],
    "description": "# Areas of Effect\r\r_v1.2 Updates_\r* The menu now includes a burst button for each effect that allows you to spawn the effect as a burst radiating out from a single token.\r* Updates to existing menu UI.\r* Created shortcut macros for spawning effects.\r* Bug fix: Delete button wasn't working after previous update.\r\r_v1.1 Updates_\r* The menu now includes an arrow button for each effect that allows you to spawn the effect between two tokens.\r* Implemented tooltips for the menu buttons.\r\rGMs, your spellcasting players will love you for this script! It lets you\rcreate graphical areas of effect for various spells and other powers, and then\ryour players can create these effects by drawing lines specifying their\rrange, origin, and angle. Areas of effect can be created from any graphic that\ryou have uploaded to your library.\r\r## AoE menu\r\rWhen the script is installed, it creates a macro for all GMs of the game to\rdisplay its main menu in the chat. This macro is also visible and usable by all players\rin the game, but only GMs are allowed to save new areas of effect. Players can\ronly spawn them.\r\r## Creating Areas of effect\r\rTo create an area of effect, follow these steps:\r1. Place the graphic you want to create an effect out of onto the VTT.\r2. Draw a straight line over it from the origin of the effect to its end/edge.\r3. Select both the line and the graphic.\r4. Open the Areas of Effect menu using its macro and select ```Save Effect```.\r5. Name the effect, and you're done!\r\rThe effect will now appear in your list of saved areas of effect. Only GMs\rcan save areas of effect.\r\r## Viewing/Spawning Areas of Effect\r\rTo view the list of saved areas of effect, open the script's menu from its\rmacro and select ```Apply an Effect```. The list will show each effect with\rits name, a preview of its graphic, and GMs will also have a button they can\ruse to delete effects.\r\rTo spawn an area of effect from this list, follow these steps:\r1. Draw a straight line from the desired origin of the effect to its desired range.\r2. Select the line.\r3. Click the effect to apply to the line from the list of saved areas of effect.\r\rOR\r\r1. Select the token the effect originates from.\r2. Click the arrow button for the effect.\r3. Click the target token for the effect's endpoint.\r\rBoth GMs and players can spawn areas of effect!\r\r_Note: Currently it is not possible to create effects from graphics purchased\rfrom the market place due to certain restrictions specified here:\rhttps://wiki.roll20.net/API:Objects#imgsrc_and_avatar_property_restrictions\r\rHowever, you can download them from your Roll20 purchased assets library and\rthen upload them to your game in order to make use of them with this script ._\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "MatrixMath", "Path Math", "Vector Math"],
    "modifies": {
      "tokens": true,
      "paths": true,
      "macros": true
    },
    "conflicts": []
}
