{
  "name": "DL Darkness",
  "script": "dldark.js",
  "version": "0.3",
  "description": "**Creates a gridded circle based on a specific token on the Dynamic Lighting layer to be used as magical darkness.** \r\r**FORUM LINK:** For full documentation, see the forum thread for this script [here](https://app.roll20.net/forum/post/9744307/script-dldark-magical-darkness-via-dynamic-lighting-layer-thread-2/?pageforid=9744307#post-9744307) (NOTE: May open in this browser tab. You may want to create a duplicate tab before clicking link)\r\r**To use:**\r- Create a dummy character whose token has the desired size and image of the darkness generated (e.g. 20ft radius black circle)\r- Add an Ability macro to call the new `!dldark` script and set as a token action\r\r **Syntax**\r`!dldark buffer makeGrid sendToMapLayer `\r **Arguments**\r-   `buffer` < `#` > //Optional. Default = 0 \r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Reduce the radius of the darkness by this many pixels.\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Allows the source of the darkness to be seen at the outer border of the darkness.\r-   `makeGrid` < `true`/`false` > //Optional. Default = true\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;draw a grid inside of the darkness circle.\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;the grid will be aligned with the map grid based on page settings\r- `SendToMapLayer` < `true`/`false` > //Optional. Default = true\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;send the source token to the map layer after creating the DL path?\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if true, will send to map layer and perform a z-order `ToFront`\r &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if false, will keep on token layer and perform a z-order `ToBack` \r\r**Example Syntax**\r`!dldark`\r`!dldark 15 true`\r`!dldark ?{buffer radius?|15} true false` \r\r**De-linking Syntax**\r By default, a link is made between the source token and the dynamic lighting path, which allows auto-movement and deletion of the path when the source token is moved or deleted. You can de-link any or all of the connections using the following syntax:\r `!dldarkclear token` //unlinks selected token and corresponding dynamic lighting path (requires token selection) \r `!dldarkclear tok` //(Alias) unlinks selected token and corresponding dynamic lighting path (requires token selection) \r `!dldarkclear page` //unlinks all tokens and corresponding dynamic lighting paths from the current page (requires token selection) \r `!dldarkclear campaign` //unlinks all tokens and corresponding dynamic lighting paths from the ENTIRE CAMPAIGN (Use caution!)",
  "authors": "David M.",
  "roll20userid": 3987469,
  "patreon": "",
  "useroptions": [],
  "dependencies": [],
  "modifies": {    
    "graphic.*": "read",
    "path.*": "write",    
    "player.displayname": "read"
  },
  "conflicts": [],
  "previousversions": [
    "0.2"
  ]
}
