{
	"name": "Door Knocker",
	"script": "DoorKnocker.js",
	"version": "1.01",
	"previousversions": ["1.00"],
	"description": "#Door Knocker v1.0\rWelcome to Door Knocker. This script helps quickly open and close doors by controlling the dynamic lighting lines.\r### Using Door Knocker\rThe script will move dynamic lighting lines used as doors to the map layer and make them transparent, opening the door. It determines what is a door and a wall based on the stroke color of the polygon and will only open doors within 1 square (default 70px) of the door knocker token.\r### Basic Command Syntax\rThe script uses a standardized API command syntax. All Door Knocker commands will begin with **!knock**. This will then be followed by a space a double dash preceding a keyword and options group. This looks like this:\r**!knock --keyWord|option1|option2|...**\r### Opening and Closing Doors\rOpen and close using the **key** keyword followed by an option to tell the script whether to open doors, close doors, or toggle doors. \rYou can also pass an optional second option to tell the script to open/close/toggle all doors within range of the knocker token. These commands look like:\r**!knock --key|open/close/toggle|all/page/campaign**\r- **key:** This is the keyword that tells the script to manipulate door dynamic lighting lines\r- **open/close/toggle:** This option tells the script to open, close, or toggle (open closed doors and close open doors) the closest door (or all doors if also using the all option)\r- **all/page/campaign:** *Optional argument* This option tells the script to operate on all doors within range, all doors on a page, or all doors in the campaign.\r### Setting up the Door Knocker\rSet the wall, door, and locked door stroke colors in the settings menu using hex color codes (e.g. #000000). You can also set these values by selecting an already created DL line. The command syntax for using a selected DL line looks like:\r**!knock --preset|wall/door|hex color**\r- **preset:** This is the keyword that tells the script to change it's settings\r- **wall/door:** This option tells the script to update the color setting for walls or for doors\r- **hex color:** *Optional argument* Passing a hex color here will set the script to consider all polygons on the Dynamic Lighting layer with a stroke of this color to be doors/walls. If this option is not passed the script will look for a selected polygon to pull a stroke color from.\r### Setting up your maps\rThe only map setup needed is to ensure your dynamic lighting doors are the appropriate color. If you are adapting a module or add-on to an already existing door color scheme you can select a door line and run the following chat command:\r**!knock --adapt|door/wall|campaign**\r- **adapt:** This is the keyword that tells the script to update all polygons on the dynamic lighting layer with the same stroke color as the selected polygon(s) to have the script's door/wall stroke color\r- **wall/door:** This option tells the script to update the stroke color to that of walls or doors\r- **campaign:** *Optional argument* adding this optional argument tells the script to update polygons on all pages, not just the current page.\r### Customizing the Script\r#### Door knocker token\rThe script uses a generic key token as the door knocker token. You can customize this by changing the default token of this character.\r#### Script created abilities\rThe script also creates three abilities on this character as token actions. These can be disabled as token actions, but should not be deleted as the script will simply remake them. You can also add whatever other macros you want to this character.\r#### Aura signalling nearby doors\rBy default the script will create two auras around the door knocker token when a door is with in range. Aura 1 will display the range to the closest door while aura 2 will display the range to the furthest door. You can customize what color these auras are by changing the aura color in the token's settings. The feature can be turned off (or back on) from the settings page of this help menu./r### Attributions/rThe default token image is from https://game-icons.net/ under the [creative commons license](https://creativecommons.org/licenses/by/3.0/#).",
	"authors": ["Scott C."],
	"roll20userid": ["459831"],
	"useroptions": [],
	"dependencies": ["Path Math","Vector Math"],
	"modifies": {
		"state.DoorKnocker": "read,write",
		"character": "read,write",
		"graphic": "read,write",
		"path":"read,write",
		"chat":"read"
	},
	"conflicts": []
}