{
    "name": "HeroSystem6e",
    "script": "HeroSystem6e.js",
    "version": "1.1",
    "previousversions": [ "1.0" ],
    "description": "# HeroSystem6e api script\r\nThis API is designed for use with the [HeroSystem6e character sheet](https:\/\/github.com\/Roll20\/roll20-character-sheets\/tree\/master\/HeroSystem6e).  If you are not using that character sheet, this api script will most likely be of no use to you.\r\n\r\nThis api script listens to chat for die rolls and its primary functions execute when they detect a \"hero6template\" roll template.  This API will count the body value of any normal damage dice and compute the DCV hit of any attack roll, sending the output to chat formatted to match the HeroSystem6e roll template.  If by some remote chance you have a use for this api script outside of the HeroSystem6e character sheet, here are the specifics of what this api will do...\r\n\r\n---\r\nThis script will count the BODY of any damage roll.  The necessary roll properties are:\r\n\r\n\t{{damage=[8d6]}}\r\n\t{{count=BODY}}\r\nThe 8d6 is just an example.  All dice must be d6.  Half dice are handled as d3 and do NOT follow the rules in the Hero6System rulebook.  \r\n\r\n---\r\nThis script will count the levels of luck from a Luck roll.  The necessary roll properties are:\r\n\r\n\t{{total=[[3d6]]}}\r\n    {{count=Luck}}\r\nThe 3d6 is just an example.\r\n\r\n---\r\nThis script will compute the DCV value of an attack roll.  The necessary roll properties are:\r\n\r\n\t{{ocv=7}}\r\n    {{attack=[[3d6]]}}\r\nThe 7 is just an example.\r\n\r\n---\r\nThe script does support some command line options that generate unformatted chat output when paired with die rolls.\r\n\r\n\t\/roll 3d6 show body\r\n    [[8d6]] show body\r\nAdding \"show body\" to a die roll will count and display the body value.  If you rolled damage dice and forgot to include the text \"show body\", you can enter the chat command \"last body\" to get the BODY count of the last die roll.\r\n\r\n\t[[8d6]]\r\n    last body\r\nIf you add the text \"hit location\" to a die roll, it will display the body part hit using the standard hit location chart.\r\n\r\n\t\/roll 3d6 hit location\r\nAnd that is all.",
    "authors": "Darren",
    "roll20userid": "1920548",
    "useroptions": [],
    "dependencies": [],
    "modifies": [],
    "conflicts": []
}
