{
    "name": "It's a Trap! - D&D 4th Edition",
    "script": "TrapTheme.js",
    "version": "3.0.1",
    "previousversions": [],
    "description": "# It's A Trap! - D&D 4th Edition\r\rThis is a trap theme to support the D&D 4th Edition character sheet by\rAlex L., Ville S., and Wesley L..\r\r## Theme-specific properties\rThe following trap properties are specific to this trap theme script.\r\r### Attack Bonus\rThe modifier for the trap's attack roll, if it makes an attack roll.\r\r### Damage\rA dice expression for the damage dealt by the trap on a hit. This does not\rtake any damage resistances or immunities into account.\r\r### Defense\rThis property specifies whether the trap's attack roll is against its victim's\rAC, Fortitude, Reflex, or Will.\r\r### Miss - Half Damage\rThis property specifies whether victims of the trap will still take half damage,\reven if they avoided the trap. This does not take into account any special\rabilities such as Evasion.\r\r### Saving Throw\rIf the trap allows a saving throw, choose which saving throw it uses with this\rproperty.\r\r### Saving Throw DC\rThis property specifies the DC for the above saving throw.\r\r### Spot DC\rThis property specifies the passive Perception needed for a character to\rpassively spot the trap.\r\r## Help\r\rDue to complications with the API reading attributes from certain character sheets,\rthere have been issues in the past with things such as saving throws or passive perception\rnot being correct. If this happens, first try adjusting the values for these on\ryour character sheet or try re-creating the character sheet from scratch to see\rif that resolves the problem.\r\rIf you continue to experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature, please reply to this thread:\rhttps://app.roll20.net/forum/post/3280344/script-its-a-trap-v2-dot-3\ror shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=newest&type=all&genre=all&author=Stephen%20Lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
