{
    "name": "HeroTracker",
    "script": "herotracker.js",
    "version": "1.1",
    "previousversions": [ "1.0" ],
    "description": "#\r\r## HeroTracker\r\r\rHeroTracker implements the turn sequence of the Hero Games system.  The Hero Games system utilizes a segment chart with 12 phases.  A character's speed determines how many and on which phases he/she gets to act.  HeroTracker will add a token to the Roll20 tracker multiple times to simulate this mechanic.\r\r### Syntax\r\r\r```!herotracker <parms>```\r\r```!ht <parms>```\r\r### Parameters:\r\r* **--help**\r* **--add**\r* **--remove**\r* **--id** <_token_id_>\r* **--tag** <_label_>\r* **--speed** <_number_>\r* **--dex** <_number_>\r* **--segment** <_number_>\r* **--speed_field** <_name_>\r* **--dex_field** <_name_>\r* **--back**\r\r---\rTo add tokens to the initiative tracker, select one or more tokens and then enter the chat command.\r\r\r```!ht --add```\r\r---\rTo remove entries, select one or more tokens and enter the chat command:\r\r```!ht --remove```\r\r---\rAlternately, you can specify a single token by its ID rather than selecting it. For example, to add a specific token, selected or not, enter this chat command:\r\r```!ht --add --id -L9sBx-soK0CQzQYCiFA --speed 5```\r\r---\rYou can also add a static label to the tracker by entering this chat command:\r\r```!ht --tag GAS-EFFECT --speed 4```\r\r---\rWhen adding a token, the speed and dex will be automatically derived from the token's attributes. However, you can override this by specifying your own speed and dex:\r\r```!ht --add --speed 6 --dex 18```\r\r---\rYou can add a token or label to just one segment by using this chat command:\r\r```!ht --add --tag POST --segment 13```\r\r---\rBecause the tracker can end up with a great many entries, it would normally create a cumbersome problem to cycle through the entire list should you accidentally move past a turn that isn't complete. As such, HeroTracker includes an option to rollback the tracker one turn:\r\r```!ht --back```\r\r---\rHero System begins a turn at segment 12. You can sort the tracker, with segment 12 at the top of the order, by using this command:\r\r```!ht --start```\r\r---\rHeroTracker uses dex to break ties by appending a decimal value to the token's speed. The value is just the dex subtracted from 100. If you do not want to use this feature, you can specify a dex of zero using this command:\r\r```!ht --add --dex 0```\r\r---\rBy default, HeroTracker uses the character sheet fields **SPD** and **DEX** to derive the speed and dex values. You can override and choose your own field names using the parameters **--speed_field** and **--dex_field**. This can also be used for characters that use a different attribute to break ties, such as ego based characters. The command would look like this:\r\r```!ht --add --dex_field EGO```\r\r---\r### Notes\r\rThe speed and dex of a selected token will be derived from the token's attributes **SPD** and **DEX** respectively.\r\rIf you specify a single token using the **--id** parameter, or create a custom label using the **--tag** parameter, you must also provide a speed or segment, and optionally a dex.\r\rEntries are added (collated) into the existing initiative order without resorting.  So if you were just starting segment 5 and a new character enters the combat, you can add the new character normally and the turn order will still be at the start of segment 5.  This also makes it easy to change a token's speed or dex in the middle of a turn if needed.  So, for example, if a character was effected by a Drain SPD attack that reduced his SPD to 2, you would select the character's token and enter the following command:\r\r```!ht --add --speed 2```\r\rThe following macro can be used to initiate combat with all selected tokens, beginning with segment 12:\r\r```\r!ht --add --tag SEGMENT --speed 12\r!ht --add --tag POST_RECOVERY --segment 13\r!ht --add --start\r```",
    "authors": "Darren",
    "roll20userid": "1920548",
    "useroptions": [],
    "dependencies": [],
    "modifies": [],
    "conflicts": []
}
