{
    "name": "It's a Trap! - Gamma World 7E theme",
    "script": "TrapTheme.js",
    "version": "1.1",
    "previousversions": ["1.0"],
    "description": "# It's A Trap! - Gamma World 7E theme\r\r_v1.1 updates:_\r* The theme now supports the 'fx' basic JSON property made available in It's A Trap! v2.3.\r\rThis is a trap theme to support the Gamma World 7E character sheet.\r\rIt provides support for D&D 5th edition mechanics to automate resolving trap\rattacks, saving throws, and passive searching.\r\rTo use this theme for the It's A Trap! script, enter \"GammaWorld7\" for the ```theme``` user option.\r\r## TrapEffect properties\r\rThis TrapTheme supports the following TrapEffect JSON properties in addition\rto all the basic TrapEffect JSON properties:\r* attack (int): The trap's attack roll bonus. Omit if the trap does not make an attack roll.\r* damage (string): The dice roll expression for the trap's damage. Omit if the trap does not deal damage.\r* missHalf (boolean): If true, then the trap deals half damage on a miss.\r* notes (string): A reminder about the trap's effects, which will be whispered to the GM.\r* defense (string): The defense targeted by the trap's attack. This can be one of \"ac\", \"fort\", \"ref\", or \"will\".\r* spotDC (int): The DC to spot the trap with passive perception. When a character spots the trap, its trigger area will be circled.\r\r### Example of use:\r\rHere is a trap JSON example to get you started:\r\r```\r{\r    \"attack\": 4,\r    \"damage\": \"2d8 + 6\",\r  \"defense\": \"ac\",\r    \"fx\": \"explode-fire\",\r    \"message\": \"A pressure plate gives way and darts fire forth from hidden compartments in the walls!\",\r    \"notes\": \"If the character is hit, they also become poisoned.\",\r    \"spotDC\": 14\r}\r```\rThe above example will have the trap make an attack against the victim's AC defense with a +4 bonus to its attack roll.\rOn a hit it does 2d8+6 damage.\rThe \"notes\" field is a message that is whispered to the GM as a reminder about anything else that happens with the trap.\rThe \"message\" is shown to everyone when the trap is triggered to describe what the trap is, and any other flavor text associated with it.\rThe DC to spot the trap with passive perception is 14.\r\r## Notes on trap automation:\rThe theme's automated attacks and saving throws do not account for conditional\rmodifiers, Advantage, or Disadvantage. Players will need to apply those in an\rad hoc fashion.\r\rIf a trap deals damage, the theme will not automatically subtract\rthe damage from the character's hit points. Players will still need to do that\rthemselves after applying conditional modifiers to their AC/saves,\rapplying damage resistance, vulnerability, etc..\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
