{
    "name": "It's a Trap! - D&D 5E Generic",
    "script": "TrapTheme.js",
    "version": "3.2",
    "previousversions": ["3.0.2", "3.0.3", "3.1"],
    "description": "# It's A Trap! - D&D 5E Generic\r\r_v3.2 Updates:_\r\r* Implemented automatic character sheet detection.\r* User can also manually select which character sheet is being used in-game.\r* User can specify custom sheet and its attributes in-game.\r\rThis is a trap theme to support any campaign using D&D 5th Edition rules.\rBy default, it will automatically detect which character sheet you're using,\rbut if needed, you can also specify which sheet the script is using from the\rtheme-specific trap properties.\r\rThis currently supports the following D&D 5E character sheets:\r\r* Roll20 Official\r* Community\r* Shaped\r\r## Theme-specific properties\rThe following trap properties are specific to this trap theme script.\r\r### Character Sheet\rManually specify which character sheet your game is using. By default, this\rwill try to auto-detect your character sheet.\r\rYou can also specify that you are using a custom character sheet. If you do so,\ran additional property will appear under this one to specify the attribute\rnames used for the custom sheet.\r\r### Attack Bonus\rThe modifier for the trap's attack roll, if it makes an attack roll.\r\r### Damage\rA dice expression for the damage dealt by the trap on a hit. This does not\rtake any damage resistances or immunities into account. Neither does it\ractually subtract the hit points. You'll have to do that manually.\r\r### Miss - Half Damage\rThis property specifies whether victims of the trap will still take half damage,\reven if they avoided the trap. This does not take into account any special\rabilities such as _Evasion_.\r\r### Saving Throw\rThis property allows you to configure a saving throw for the trap which is\rrolled automatically for each affected character.\r\rThe first prompt asks for which saving throw to use.\r\rThe second prompt asks for the saving throw's DC.\r\rThe third prompt asks whether the result of the saving throw should be visible\ronly to the GM, hidden from the players.\r\r### Passive Detection DC\rThis property specifies the passive Perception score needed for a character to\rpassively detect the trap.\r\r## Help\r\rMy scripts are provided 'as-is', without warranty of any kind, expressed or implied.\r\rThat said, if you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\rWhen messaging me about an issue, please be sure to include any error messages that\rappear in your API Console Log, any configurations you've got set up for the\rscript in the VTT, and any options you've got set up for the script on your\rgame's API Scripts page. The more information you provide me, the better the\rchances I'll be able to help.\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts,\rplease consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/search?category=itemtype:Art&author=Stephen%20Lindberg|Stephen%20L\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
