{
    "name": "It's a Trap! - Roleplaying is Magic 4E theme",
    "script": "TrapTheme.js",
    "version": "1.1",
    "previousversions": ["1.0"],
    "description": "# It's A Trap! - Roleplaying is Magic 4E theme\r\r_v1.1 updates:_\r* The theme now supports the 'fx' basic JSON property made available in It's A Trap! v2.3.\r\rThis is a My Little Pony: Roleplaying is Magic 4th edition theme for the It's A Trap! script,\rbuilt for use with the Roleplaying is Magic 4E character sheet.\r\rIt provides support for automated passive perception of traps using a passive\rPerception skill roll, and it allows automated skill rolls to avoid activated traps.\r\rTo use this theme for the It's A Trap! script, enter \"MLP-RIM-4\" for the ```theme``` user option.\r\r## TrapEffect properties\r\rThis TrapTheme supports the following TrapEffect JSON properties in addition\rto all the basic TrapEffect JSON properties:\r* damage (string): The dice roll expression for the trap's damage. Omit if the trap does not deal damage.\r* missHalf (boolean): If true, then the trap deals half damage on a miss.\r* skill (object)\r  * attr (string): The skill's primary attribute (used if the character is not trained in the skill).\r  * dif (int): The difficulty for the skill check.\r  * name (string): The name of the skill.\r* spotDif (int): The difficulty to spot the trap with a passive Perception skill check.\r\r*Example JSON*\r\rHere's an example of how to use the trap JSON for this theme:\r\r```\r{\r  \"damage\": \"2d6 + 5\",\r  \"fx\": \"explode-fire\",\r  \"message\": \"Spectral spears suddenly launch out of the ground!\",\r  \"missHalf\": true,\r  \"skill\": {\r    \"name\": \"dodge\",\r    \"attr\": \"body\",\r    \"dif\": 10\r  },\r  \"spotDif\": 8\r}\r```\r\rThis trap makes the character roll a dodge skill check when it is activated\r(if they don't have that skill, the character rolls a Body check instead).\rThe difficulty for the skill check is 10. On a hit, the trap deals 2d6 + 5 damage.\rOn a miss, the trap deals half damage.\r\r### Note about passive Perception\r\rThe Roleplaying is Magic 4E system doesn't actually have any defined rolls for\rpassive skill checks. For the purpose of this script, a character's passive Perception is\rcalculated as follows:\r\r```\r4 + (total Advantage/Disadvantage modifier) + Mind + (3 if trained) + (2 if improved) + (1 if greater) + (total Misc modifiers)\r```\r\rSo for example, a character not trained in Perception with a Mind of 2 would\rhave a passive Perception of 6. A character trained in Perception with a Mind\rof 4 would have a passive Perception of 11.\r\r## Notes on trap automation:\rThe theme's automated attacks and saving throws do not account for conditional\rmodifiers. Players will need to apply those in an ad hoc fashion.\r\rIf a trap deals damage, the theme will not automatically subtract\rthe damage from the character's Fortitude or Willpower. Players will still need to do that\rthemselves after applying conditional modifiers to skill check,\rapplying damage resistance, vulnerability, etc..\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["It's a Trap!", "Roleplaying is Magic 4E Dice"],
    "modifies": {},
    "conflicts": []
}
