{
    "name": "It's a Trap! - Roleplaying is Magic 4E theme",
    "script": "TrapTheme.js",
    "version": "3.1",
    "previousversions": ["1.0", "1.1", "1.2", "3.0"],
    "description": "# It's A Trap! - Roleplaying is Magic 4E theme\r\rThis is a My Little Pony: Roleplaying is Magic 4th edition theme for the It's A Trap! script,\rbuilt for use with the Roleplaying is Magic 4E character sheet.\r\r### Note about passive Perception\r\rThe Roleplaying is Magic 4E system doesn't actually have any defined rolls for\rpassive skill checks. For the purpose of this script, a character's passive Perception is\rcalculated as follows:\r\r```\r4 + (total Advantage/Disadvantage modifier) + Mind + (3 if trained) + (2 if improved) + (1 if greater) + (total Misc modifiers)\r```\r\rSo for example, a character not trained in Perception with a Mind of 2 would\rhave a passive Perception of 6. A character trained in Perception with a Mind\rof 4 would have a passive Perception of 11.\r\r## Help\r\rDue to complications with the API reading attributes from certain character sheets,\rthere have been issues in the past with things such as saving throws or passive perception\rnot being correct. If this happens, first try adjusting the values for these on\ryour character sheet or try re-creating the character sheet from scratch to see\rif that resolves the problem.\r\rIf you continue to experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature, please reply to this thread:\rhttps://app.roll20.net/forum/post/3280344/script-its-a-trap-v2-dot-3\ror shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, and maintaining my API scripts, consider buying one of my art packs from the Roll20 marketplace (https://marketplace.roll20.net/browse/search/?keywords=&sortby=newest&type=all&genre=all&author=Stephen%20Lindberg)\ror, simply leave a thank you note in the script's thread on the Roll20 forums.\rEither is greatly appreciated! Happy gaming!\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "It's a Trap!", "Roleplaying is Magic 4E Dice"],
    "modifies": {},
    "conflicts": []
}
