{
    "name": "ChatSetAttr",
    "script": "ChatSetAttr.js",
    "version": "1.1.4",
    "description": "\n\n# ChatSetAttr \n This script is a utility that allows the user to create, modify, or delete character attributes via chat messages or macros. There are several options that determine which attributes are modified, and which characters the attributes are modified for. The script is called by the command **!setattr [--options]** for creating or modifying attributes, or **!delattr [--options]** for deleting attributes. Note that the script will not trigger any Sheet Workers that would be triggered by modifying these attributes manually. This will be changed once this becomes possible.\n\n## Selecting a target\n One (and only one) of the following options must be specified; they determine which characters are affected by the script.\n* **--all** will affect all characters in the game. USE WITH CAUTION. This option will only work for the GM. If you have a large number of characters in your campaign, this will take a while to process all attribute changes.\n* **--allgm** will affect all characters which do not have a controlling player set, which typically will be every character that is not a player character. USE WITH CAUTION. This option will only work for the GM. \n* **--charid charid1, charid2, ...** allows you to supply a list of character ids, and will affect characters whose ids come from this list. Non-GM Players can only affect characters that they control.\n* **--name name1, name2, ...** allows you to supply a list of character names, and will look for a character with this name to affect. Non-GM Players can only affect characters that they control.\n* **--sel** will affect all characters that are represented by tokens you have currently selected.\n\n## Additional options\n These options will have no effect on **!delattr**, except for **--silent**.\n* **--silent** will suppress normal output; error messages will still be displayed.\n* **--replace** will replace the characters < , > , # , ~ , ; , and ` by the characters [,],|,-,?, and @ in attribute values. This is useful when you do not want roll20 to evaluate your expression in chat before it is parsed by the script.**\n* **--nocreate** will change the script's default behaviour of creating a new attribute when it cannot find one; instead, the script will display an error message when it cannot find an existing attribute with the given name.\n* **--mod** will add the new value to the existing value instead of replacing it. If the existing value is a number (or empty, which will be treated as 0), the new value will be added to the existing value. If not, an error message will be displayed instead. Try not to apply this option to attributes whose values are not numbers. You can use **!modattr** as a shortcut for **!setattr --mod**.\n* **--modb** works like **--mod**, except that the attribute's current value is kept between 0 and its maximum.\n* **--reset** will simply reset all entered attribute values to the maximum; the values you enter are ignored. You can use **!resetattr** as a shortcut for **!setattr --reset**.\n* **--evaluate** is a GM-only (unless you allow it to be used by players via the configuration) option that will use javascript eval() to evaluate the attribute value expressions. This allows you to do math in expressions involving other attributes (see the example below). However, this option is inherently dangerous and prone to errors, so be careful.\n\n## Attribute Syntax\n Attribute options will determine which attributes are set to which value (respectively deleted, in case of !delattr). The syntax for these options is **--name|value** or **--name|value|max**. Here, **name** is the name of the attribute (which is parsed case-insensitively), **value** is the value that the current value of the attribute should be set to, and **max** is the value that the maximum value of the attribute should be set to.\n* Single quotes (') surrounding **value** or **max** will be stripped, as will trailing spaces. If you need to include spaces at the end of a value, enclose the whole expression in single quotes.\n* If the option is of the form **--name|value**, then the maximum value will not be changed.\n* If it is of the form **--name||max**, then the current value will not be changed.\n* You can also just supply **--name|** or **--name** if you just want to create an empty attribute or set it to empty if it already exists, for whatever reason.\n* **value** and **max** are ignored for **!delattr**.\n* If you want to empty the current attribute and set some maximum, use **--name|''|max**.\n* The script can deal with repeating attributes. Due to a technical limitation, if a repeating attribute is given by row index, e.g. repeating _ action _ $0_name, the script will not know if the rows have been reordered, and reference repeating rows in order of creation, not in the order they are displayed in. If you want to create a new repeating row in a repeating section with name **prefix**, use the attribute name **repeating_prefix_-CREATE_name**.\n* You can insert the values of _other_ attributes into the attributes values to be set via %attribute_name%. For example, **--attr1|%attr2%|%attr2_max%** will insert the current and maximum value of **attr2** into those of **attr1**.\n\n## Examples\n* **!setattr --sel --Strength|15** will set the Strength attribute for 15 for all selected characters.\n* **!setattr --name John --HP|17|27 --Dex|10** will set HP to 17 out of 27 and Dex to 10 for the character John (only one of them, if more than one character by this name exists).\n* **!delattr --all --gold** will delete the attribute called gold from all characters, if it exists.\n* **!setattr --sel --mod --Strength|5** will increase the Strength attribute of all selected characters by 5, provided that Strength is either empty or has a numerical value - it will fail to have an effect if, for example, Strength has the value 'Very big'.\n* **!setattr --sel  --Ammo|%Ammo_max%** will reset the Ammo attribute for the selected characters back to its maximum value.\n* If the current value of attr1 is 3 and the current value of attr2 is 2, **!setattr --sel --evaluate --attr3|2*%attr1% + 7 - %attr2%** will set the current value of attr3 to 15.\n\n## Global configuration\n There are twos global configuration options, _playersCanModify_ and _playersCanEvaluate_, which can be toggled either on this page or by entering **!setattr-config** in chat. They will give players the possibility of modifying characters they don't control or using the *--evaluate* option. You should only activate either of these if you can trust your players not to vandalize your characters or your campaign.",
    "authors": "Jakob",
    "roll20userid": "726129",
    "useroptions": [
        {
        "name": "Players can modify all characters",
        "type": "checkbox",
        "description": "Select this option to allow all players to use the `--charid` or `--name` parameter to specify characters they don't control to be modified.",
        "value": "playersCanModify"
        },
        {
        "name": "Players can use --evaluate",
        "type": "checkbox",
        "description": "Select this option to allow players to use the --evaluate option. Be careful, this will potentially give players unrestricted access to the API sandbox.",
        "value": "playersCanEvaluate"
        }
    ],
    "dependencies": {},
    "modifies": {
        "state.ChatSetAttr" : "read,write",
        "attribute.characterid": "read",
        "attribute.current": "read,write",
        "attribute.max": "read,write",
        "character.controlledby": "read",
        "character.name": "read",
        "graphic.represents": "read"
    },
    "conflicts": [],
    "previousversions": ["0.9","0.9.1","1.0","1.0.1","1.0.2","1.1","1.1.1","1.1.2","1.1.3"]
}
