{
    "name": "SpellMaster-SRD",
    "script": "SRD.js",
    "version": "2.005",
    "previousversions": ["2.002", "2.004"],
    "description": "# SpellMaster SRD Spell List\r\rThis is a dependency of SpellMaster and provides the stock list of SRD spells, which are released under the OGL.  This resource file has been separated due to size.\r\r## Contact\r\rFeel free to contact me at any of the following for comments, suggestions, or bug reports.\r- [github](https://github.com/VoltCruelerz)\r- [Roll20](https://app.roll20.net/users/1583758/gm-michael)\r- [Forums](https://app.roll20.net/forum/post/8109696/script-spellmaster-2-dot-0-5e-ogl-magic-handler-thread-3)\r\r## Open Game Licence\rThe data within this resource library is derivative of spells from the SRD5, which is released under OGL, reproduced below.\r\r**OPEN GAME LICENSE Version 1.0a** \rThe following text is the property of Wizards of the \rCoast, Inc. and is Copyright 2000 Wizards of the \rCoast, Inc (\"Wizards\"). All Rights Reserved. \r1. Definitions: (a)\"Contributors\" means the \rcopyright and/or trademark owners who have \rcontributed Open Game Content; (b)\"Derivative \rMaterial\" means copyrighted material including \rderivative works and translations (including into \rother computer languages), potation, modification, \rcorrection, addition, extension, upgrade, \rimprovement, compilation, abridgment or other \rform in which an existing work may be recast, \rtransformed or adapted; (c) \"Distribute\" means to \rreproduce, license, rent, lease, sell, broadcast, \rpublicly display, transmit or otherwise distribute; \r(d)\"Open Game Content\" means the game mechanic \rand includes the methods, procedures, processes \rand routines to the extent such content does not \rembody the Product Identity and is an enhancement \rover the prior art and any additional content clearly \ridentified as Open Game Content by the Contributor, \rand means any work covered by this License, \rincluding translations and derivative works under \rcopyright law, but specifically excludes Product \rIdentity. (e) \"Product Identity\" means product and \rproduct line names, logos and identifying marks \rincluding trade dress; artifacts; creatures characters; \rstories, storylines, plots, thematic elements, dialogue, \rincidents, language, artwork, symbols, designs, \rdepictions, likenesses, formats, poses, concepts, \rthemes and graphic, photographic and other visual \ror audio representations; names and descriptions of \rcharacters, spells, enchantments, personalities, \rteams, personas, likenesses and special abilities; \rplaces, locations, environments, creatures, \requipment, magical or supernatural abilities or \reffects, logos, symbols, or graphic designs; and any \rother trademark or registered trademark clearly \ridentified as Product identity by the owner of the \rProduct Identity, and which specifically excludes the \rOpen Game Content; (f) \"Trademark\" means the \rlogos, names, mark, sign, motto, designs that are \rused by a Contributor to identify itself or its \rproducts or the associated products contributed to \rthe Open Game License by the Contributor (g) \"Use\", \r\"Used\" or \"Using\" means to use, Distribute, copy, edit, \rformat, modify, translate and otherwise create \rDerivative Material of Open Game Content. (h) \"You\" \rNot for resale. Permission granted to print or photocopy this document for personal use only. System Reference Document 5.1 2\ror \"Your\" means the licensee in terms of this \ragreement. \r2. The License: This License applies to any Open \rGame Content that contains a notice indicating that \rthe Open Game Content may only be Used under and \rin terms of this License. You must affix such a notice \rto any Open Game Content that you Use. No terms \rmay be added to or subtracted from this License \rexcept as described by the License itself. No other \rterms or conditions may be applied to any Open \rGame Content distributed using this License. \r3. Offer and Acceptance: By Using the Open Game \rContent You indicate Your acceptance of the terms of \rthis License. \r4. Grant and Consideration: In consideration for \ragreeing to use this License, the Contributors grant \rYou a perpetual, worldwide, royalty-free, nonexclusive license with the exact terms of this License \rto Use, the Open Game Content. \r5. Representation of Authority to Contribute: If You \rare contributing original material as Open Game \rContent, You represent that Your Contributions are \rYour original creation and/or You have sufficient \rrights to grant the rights conveyed by this License. \r6. Notice of License Copyright: You must update the \rCOPYRIGHT NOTICE portion of this License to \rinclude the exact text of the COPYRIGHT NOTICE of \rany Open Game Content You are copying, modifying \ror distributing, and You must add the title, the \rcopyright date, and the copyright holder's name to \rthe COPYRIGHT NOTICE of any original Open Game \rContent you Distribute. \r7. Use of Product Identity: You agree not to Use any \rProduct Identity, including as an indication as to \rcompatibility, except as expressly licensed in \ranother, independent Agreement with the owner of \reach element of that Product Identity. You agree not \rto indicate compatibility or co-adaptability with any \rTrademark or Registered Trademark in conjunction \rwith a work containing Open Game Content except \ras expressly licensed in another, independent \rAgreement with the owner of such Trademark or \rRegistered Trademark. The use of any Product \rIdentity in Open Game Content does not constitute a \rchallenge to the ownership of that Product Identity. \rThe owner of any Product Identity used in Open \rGame Content shall retain all rights, title and interest \rin and to that Product Identity. \r8. Identification: If you distribute Open Game \rContent You must clearly indicate which portions of \rthe work that you are distributing are Open Game \rContent. \r9. Updating the License: Wizards or its designated \rAgents may publish updated versions of this License. \rYou may use any authorized version of this License \rto copy, modify and distribute any Open Game \rContent originally distributed under any version of \rthis License. \r10. Copy of this License: You MUST include a copy of \rthis License with every copy of the Open Game \rContent You Distribute. \r11. Use of Contributor Credits: You may not market \ror advertise the Open Game Content using the name \rof any Contributor unless You have written \rpermission from the Contributor to do so. \r12. Inability to Comply: If it is impossible for You to \rcomply with any of the terms of this License with \rrespect to some or all of the Open Game Content due \rto statute, judicial order, or governmental regulation \rthen You may not Use any Open Game Material so \raffected. \r13. Termination: This License will terminate \rautomatically if You fail to comply with all terms \rherein and fail to cure such breach within 30 days of \rbecoming aware of the breach. All sublicenses shall \rsurvive the termination of this License. \r14. Reformation: If any provision of this License is \rheld to be unenforceable, such provision shall be \rreformed only to the extent necessary to make it \renforceable. \r15. COPYRIGHT NOTICE \rOpen Game License v 1.0a Copyright 2000, Wizards \rof the Coast, LLC. \rSystem Reference Document 5.1 Copyright 2016, \rWizards of the Coast, Inc.; Authors Mike Mearls, \rJeremy Crawford, Chris Perkins, Rodney Thompson, \rPeter Lee, James Wyatt, Robert J. Schwalb, Bruce R. \rCordell, Chris Sims, and Steve Townshend, based on \roriginal material by E. Gary Gygax and Dave Arneson. \rEND OF LICENSE ",
    "authors": "M. Greene",
    "roll20userid": "1583758",
    "useroptions": [],
    "dependencies": [],
    "modifies": {},
    "conflicts": []
}