{
  "name": "Token Fate",
  "version": "1.1.1",
  "description": "The goblin reinforcements have arrived with their crude bows at the ready! They scan the caves beyond their bretheren who are engaged in melee. Who will they fire on?\rA vicar floats above his acolytes who are being cut down by the infidels on the floor of the chapel below. Dark paralyzing energies granted by his chaotic god have the strength to affect two of the intruders, but which two?\rSometimes a berserker has a choice: who does he pulp with his battleaxe? Often someone has drawn his ire, and an obvious candidate presents themselves. Other times the world at large is his antagonizer, and only Token Fate can decide which individual his wrath will be visited upon.\rA rollable table with an entry for each party member would work, but sometimes a subset need to be excluded from fate's fickle gaze.\rYou could roll 1dX, with each result representing a valid option, but then each result needs to be translated for all parties invested before the die is cast.\r\rNow, simply select any number of tokens, and call upon **!token-fate**\rWow! Fast. Easy. Impartial.\r\r>Token Fate will randomly select a token from the selected group on the virtual table top for any nefarious purpose you see fit. The name on the token is given preference, but the name of the represented character will be used if the token has no name of it's own. In the case that a selected token has no name and represents no character, it will be skipped and a new candidate will be selected. If no eligible candidates are found, or if no tokens were selected in the first place, it will output that No Token has been selected.____`!token-fate`/rExecute while you have a group of tokens selected for best results\r`!token-fate-w`/rExecute while you have a group of tokens selected for best results whispered to the GM!\r\rBoth of the above commands will now accept a single integer or inline roll argument! Tokens equal to the number passed can now suffer the same fate!",
  "authors": "Davemania",
  "roll20userid": "76",
  "script": "tokenFate.js",
  "previousversions": [
    "1.0.0",
    "1.1.0"
  ]
}
