{
    "name": "It's a Trap! - Burn Bryte theme",
    "script": "TrapTheme.js",
    "version": "3.0",
    "previousversions": [],
    "description": "# It's A Trap! - Burn Bryte Generic theme\r\rThis is a Burn Bryte trap theme built to support all Burn Bryte character sheets\rBy default, it will automatically detect which character sheet you're using,\rbut if needed, you can also specify which sheet the script is using from the\rtheme-specific trap properties.\r\rThis currently supports the following Burn Bryte character sheets:\r\r* Roll20\r\r## Theme-specific properties\rThe following trap properties are specific to this trap theme script.\r\r### Character Sheet\rManually specify which character sheet your game is using. By default, this\rwill try to auto-detect your character sheet.\r\rYou can also specify that you are using a custom character sheet. If you do so,\ran additional property will appear under this one to specify the attribute\rnames used for the custom sheet.\r\r### Attack Complexity\rWhen the trap activates, any characters affected will be prompted to use an action\rto attempt to resolve the trap by avoiding it, disarming it, or otherwise nullifying its effects.\rDuring combat, this property should be ignored in favor of the Adrenaline Effect rules.\r\r### On Hit\rDescribe here what happens if a target fails their skill roll against the trap.\r\rE.g. 'The target takes 1 damage.' or 'Gain a minor condition - sprained ankle.'\r\r#### Failure Prompts\rThe On Hit property supports integration with Burn Bryte's Failure-Prompts\rrollable table. To use it, just enter 'prompt' (without the quotes) for the\rOn Hit property.\r\r### Perception Complexity\rIf this is set, passive perception will be enabled for the trap.\rWhen a character gets close enough, this script will automatically roll their\rPerception skill against the trap's Detection Complexity to attempt to notice it.\rDuring combat, this does NOT count as an action.\r\r## Help\r\rMy scripts are provided 'as-is', without warranty of any kind, expressed or implied.\r\rThat said, if you experience any issues while using this script,\rneed help using it, or if you have a neat suggestion for a new feature,\rplease shoot me a PM:\rhttps://app.roll20.net/users/46544/stephen-l\r\rWhen messaging me about an issue, please be sure to include any error messages that\rappear in your API Console Log, any configurations you've got set up for the\rscript in the VTT, and any options you've got set up for the script on your\rgame's API Scripts page. The more information you provide me, the better the\rchances I'll be able to help.\r\r## Show Support\r\rIf you would like to show your appreciation and support for the work I do in writing,\rupdating, maintaining, and providing tech support my API scripts,\rplease consider buying one of my art packs from the Roll20 marketplace:\r\rhttps://marketplace.roll20.net/browse/search?category=itemtype:Art&author=Stephen%20Lindberg|Stephen%20L\r",
    "authors": "Stephen Lindberg",
    "roll20userid": 46544,
    "useroptions": [],
    "dependencies": ["HTML Builder", "It's a Trap!"],
    "modifies": {},
    "conflicts": []
}
