{
    "name": "5th Edition OGL by Roll20 Companion",
    "script": "5th Edition OGL by Roll20 Companion.js",
    "version": "1.4.5",
    "previousversions": ["1.0","1.1","1.2","1.3","1.4","1.4.1","1.4.2","1.4.3","1.4.4"],
    "description": "Enhances the Official 5th Edition OGL by Roll20 Character Sheet. The Companion currently supports Ammo Tracking, Automatic NPC Tokens, Automatic Death Save Tracking, and Automatic Spell Slot Tracking.\r\r**API Commands:**\r**!5ehelp** - Gives a list of the script's API commands in the chat tab.\r**!5estatus** - Lists the current status of the script's features in the chat tab.\r**!ammotracking** on/off/player/quiet - Automatically expends linked resource when attack is made.\r**!autonpctoken** on/off - Automatically generates a NPC token on the GM's screen based on the default token when an NPC's health calculation is rolled\r**!deathsavetracking** on/off/player/quiet - Automatically ticks off successes and failures when death saves are rolled, clearing on death, stabilization, or hp recovery\r**!spelltracking** on/off/player/quiet - Automatically expends spell charges as cast, factoring in higher level casting\r**!longrest** character name - If spelltracking is on, this command will reset all of the character's spell slots to unspent.\r**!npchp** character name - Rolls NPC hit point totals using their formula and updates the token bar. If no character name is provided it will roll the selected tokens.\r\r**Options:**\r**on** - Toggles the functionality on (default)\r**off** - Disables the functionality\r**player** - Maintains functionality but only sends data to the GM and the player involved.\r**quiet** - Maintains functionality while preventing results from being output to the chat.\r\r**Ammo Tracking:**\rDirections for ammo tracking can be found in the [wiki](https://wiki.roll20.net/5th_Edition_OGL_by_Roll20#Automatic_Ammunition_Tracking). You can spend more than one piece of ammunition per shot by adding a number after the name of the ammunition resource and a comma. (ex. Arrows,2 )",
    "authors": "Steve K., Chris M., Christopher D.",
    "roll20userid": "5047,2824773,3027808",
    "useroptions": [],
    "dependencies": [],
    "modifies": {},
    "conflicts": []
}
